{
  "id": "079f5ebb-5eda-4d44-af3f-41af5c5c8f8a",
  "name": "Pierre DeBois",
  "photo": "https://sessionize.com/image/383c-400o400o1-bb-5eda-4d44-af3f-41af5c5c8f8a.51d748ed-3aff-4ac5-b665-919559d59898.jpeg",
  "bio": "Pierre DeBois is the founder and CEO of Zimana, an analytics services firm that help organizations achieve profitability improvements in marketing, Web development, and within their business operations. Zimana has provided services for businesses from many industries.   Pierre’s articles are among CMSWire's Top 10 Digital Marketing Articles for 2018, 2020, 2021 and 2022.\n \n Pierre has provided digital marketing and analytic workshops. His first major workshop was for the City of Chicago Treasurer’s Office as part of the 2014 Small Business Expo (SBE). He has also conducted several workshops since the 2014 SBE, including the following: \n \n •\tA general marketing workshop and panel for General Assembly in Chicago\n •\tCivicBLUE workshops for BlueLacuna, a business incubator in the Pilsen neighborhood of Chicago; CivicBLUE explained the importance of data science for developing community solutions\n •\tThe DX Summit, a marketing conference hosted by CMS Wire in 2015, 2016, and 2017\n •\tR programming workshop at Interop ITX in Las Vegas \n •\tAnalytics workshop for Content Marketing World in Cleveland (2017).\n •\tGoogle Analytics and R programming at Indy.Code and Nebraska.Code, developers conferences in Indianapolis, Indiana and Council Bluffs, Iowa (Omaha), respectively (Pierre will be back at both conferences for 2019 ).\n •\tSentiment Analysis at O’Reilly OSCON in Portland Oregon (2018).\n •\tTensorflow in R Programming; A Primer at DevFest KC 2019, Kansas City, MO. \n •\tTensorflow in R Programming; A Primer at Tom Tom AML, Charlottesville, VA\n •\tExploratory Data Analysis in R Programming, CodeMash, Sandusky, OH\n \n His workshops have covered the gamut of business, data science, and programming topics, with a focus on JavaScript frameworks, Google Analytics, and R Programming.\n \n Pierre is also an analytics tech and business intelligence writer. He has contributed articles to CMS Wire, DMNews, and Information Week. He is also an associate editor of business book reviews for Small Business Trends, as well as credit as a technical editor for two Pearson/Que digital marketing publications.   He is currently working on his first R programming book, R for Business Intelligence.\n \n Pierre has been featured in the Chicago Sun-Times, and was a presenter for the Google Get Your Business Online program.  He successfully brought the program back to Gary Indiana in 2017.\n \n Pierre is a Prairie View A &amp; M University graduate (mechanical engineering) and a Georgia Tech graduate (MBA).  He is a native of Gary, Indiana, serving small businesses and organizations throughout the United States.\n \n",
  "links": [
    {
      "title": "Twitter",
      "url": "https://twitter.com/ZimanaAnalytics"
    },
    {
      "title": "LinkedIn",
      "url": "https://www.linkedin.com/in/pierredebois/"
    },
    {
      "title": "Blog",
      "url": "https://medium.com/@zimanaanalytics"
    }
  ]
}