{
  "id": "530110",
  "title": "Understanding CSS Layout: the concepts underlying your (least) favorite language.",
  "speakers": [
    {
      "id": "f65ba841-c138-4124-bed5-fdb778ddc7aa",
      "name": "Kilian Valkhof",
      "photo": "https://sessionize.com/image/250b-400o400o1-SHWMWcFrAxfjBSvvwn1whn.jpg",
      "bio": "Kilian is a front-end developer with over 20 years of experience that switched from building websites to building apps to build websites with. He is interested in modern web development, desktop app development and new technologies, and regularly speaks about topics like responsive websites, design systems and Electron. Kilian is a frequent open source contributor.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/kilianvalkhof"
        },
        {
          "title": "LinkedIn",
          "url": "https://linkedin.com/in/kilianvalkhof"
        },
        {
          "title": "Blog",
          "url": "https://kilianvalkhof.com"
        },
        {
          "title": "Company Website",
          "url": "https://polypane.app"
        }
      ]
    }
  ],
  "room": "Salon D",
  "track": "Design (UI/UX/CSS/a11y)",
  "tags": [
    "Front End",
    "CSS"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Friday",
  "startTime": "9:45",
  "endTime": "10:45",
  "excerpt": "Have you ever felt perplexed by CSS, struggling to understand why the browser put the element where it did, and why it didn’t just follow the clear instructions you wrote? Do you think CSS is hard to work with?\n\nBy getting a better understanding of the concepts that underlie the language, you’ll...",
  "description": "Have you ever felt perplexed by CSS, struggling to understand why the browser put the element where it did, and why it didn’t just follow the clear instructions you wrote? Do you think CSS is hard to work with?\n\nBy getting a better understanding of the concepts that underlie the language, you’ll learn to “see the matrix”. There’s normal flow, stacking context, offset parents… how do they interact with grid and flex layouts? This talk unveils those concepts in a fun and engaging way."
}