{
  "id": "530180",
  "title": "Multithreaded Income: How Developers Can Achieve Parallel Success",
  "speakers": [
    {
      "id": "37313769-11ae-4245-93b3-e6e60d5d187c",
      "name": "Kevin Griffin",
      "photo": "https://sessionize.com/image/8f96-400o400o1-69-11ae-4245-93b3-e6e60d5d187c.8d6d9927-2dd8-4e29-82b7-eaf585033c6a.jpg",
      "bio": "Kevin Griffin is an author, teacher, mentor, and consultant focusing on software development.  He is also a 14-time Microsoft MVP, specializing in ASP.NET and web development.  As the owner of Swift Kick, a software training and services company, Kevin specializes in helping businesses push their technology stacks into the 21st century.   Kevin is often speaking at conferences and user groups nationwide or blogging at https://consultwithgriff.com.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/1kevgriff"
        },
        {
          "title": "LinkedIn",
          "url": "https://linkedin.com/in/1kevgriff"
        },
        {
          "title": "Blog",
          "url": "https://consultwithgriff.com"
        },
        {
          "title": "Company Website",
          "url": "https://consultwithgriff.com"
        }
      ]
    }
  ],
  "room": "Indigo Bay",
  "track": "Career Development",
  "tags": [
    "Career Development",
    "Soft Skills"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Friday",
  "startTime": "12:15",
  "endTime": "13:15",
  "excerpt": "In an unpredictable tech industry, job security is fragile. How can developers harness their unique skills to create a diversified, resilient professional life? This talk presents the concept of \"Multithreaded Income,\" a strategic approach to building parallel income streams inspired by the...",
  "description": "In an unpredictable tech industry, job security is fragile. How can developers harness their unique skills to create a diversified, resilient professional life? This talk presents the concept of \"Multithreaded Income,\" a strategic approach to building parallel income streams inspired by the principles of multithreading in software development.\n\nWhat You'll Learn:\n\n* Moonlighting &amp; Side Gigs: Leverage your skills to create supplementary income streams without compromising your primary role.\n\n* Course Building &amp; Book Writing: Turn your expertise into educational content for additional revenue.\n\n* Ethical Balancing &amp; Time Management: Strategies for maintaining professional ethics and personal well-being across multiple commitments.\n\n* Path to Financial Freedom: A roadmap for constructing a diverse income portfolio resilient to the tech industry's uncertainties.\n\nJoin us to explore a new paradigm for financial stability in your career, aligning technology's best practices with innovative career strategies."
}