{
  "id": "530551",
  "title": "Building Relationships for Better Security",
  "speakers": [
    {
      "id": "75788862-bda6-48b5-96bb-18c1fd7ba0d2",
      "name": "Darylynn Ross",
      "photo": "https://sessionize.com/image/fc9c-400o400o1-3igmogkTR8hsPVmbtg9kdb.jpeg",
      "bio": "Darylynn Ross is currently a Senior Application Security Engineer on the Product Security team at CoverMyMeds (CMM). She directs the CMM Security Champions Group and the CMM Security Community of Practice.  Darylynn spent the first part of her career at EDS and Verizon Wireless as a software developer working in varied applications, languages, databases and development environments. After pivoting to application security at Verizon, she worked with Chipotle's security operations team as Security Operations Analyst and Application Security Engineer. Darylynn is passionate about developing a security first culture fostered by relationship building and mentoring. In her free time, Darylynn enjoys working on event planning for several organizations, walking her dog Maple, and traveling with her husband.",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/darylynn-ross-csslp-cissp"
        }
      ]
    }
  ],
  "room": "Salon B",
  "track": "Security",
  "tags": [
    "Security",
    "Soft Skills",
    "Leadership"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Thursday",
  "startTime": "13:00",
  "endTime": "14:00",
  "excerpt": "It's 2024 and software engineering teams and security teams are still struggling to figure out how we can all just get along. Engineering teams are commonly frustrated and annoyed at all the extraneous stuff security wants them to do. And security teams are commonly frustrated with the lack of...",
  "description": "It's 2024 and software engineering teams and security teams are still struggling to figure out how we can all just get along. Engineering teams are commonly frustrated and annoyed at all the extraneous stuff security wants them to do. And security teams are commonly frustrated with the lack of results they see in vulnerability remediation and secure coding efforts. There's got to be a better way to work together.\n\nCome explore how building relationships between engineering teams and security teams can remove some of the frustration we all feel in the software product development world. Initiatives like a security champions program, a security community of practice, meaningful training, and team collaboration can make a difference. This session isn't just for managers or security practitioners, it's for everyone who works in IT and deals with security challenges."
}