{
  "id": "530635",
  "title": "AI Speaks: Giving Large Language Models a Voice with Alexa",
  "speakers": [
    {
      "id": "6baa8ae0-aa56-42e3-8ab8-6c511a55c2bc",
      "name": "Craig Walls",
      "photo": "https://sessionize.com/image/42f5-400o400o1-9pY1kLHD9oGMPofcHPGHvc.jpeg",
      "bio": "Craig Walls is an engineer with VMware, Java Champion, Alexa Champion, and the author of Spring in Action, Spring Boot in Action, and Build Talking Apps. He's a zealous promoter of the Spring Framework, speaking frequently at local user groups and conferences and writing about Spring. When he's not slinging code, Craig is planning his next trip to Disney World or Disneyland and spending as much time as he can with his wife, two daughters, 1 bird and 3 dogs.",
      "links": [
        {
          "title": "Twitter",
          "url": "http://twitter.com/habuma"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/habuma/"
        },
        {
          "title": "Blog",
          "url": "https://medium.com/feed/@thetalkingapp"
        }
      ]
    }
  ],
  "room": "Salon G",
  "track": "Hardware/IoT",
  "tags": [
    "Javascript",
    "IoT",
    "Machine Learning"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Thursday",
  "startTime": "9:15",
  "endTime": "10:15",
  "excerpt": "Large Language Models (LLM) have been quite the buzz lately, offering one of the first tangible applications of artificial intelligence for the masses. Despite quirks and \"hallucinations\", LLMs show real promise of being a valuable component in the future of thinking machines.\n\nMeanwhile, for a few...",
  "description": "Large Language Models (LLM) have been quite the buzz lately, offering one of the first tangible applications of artificial intelligence for the masses. Despite quirks and \"hallucinations\", LLMs show real promise of being a valuable component in the future of thinking machines.\n\nMeanwhile, for a few years, voice technologies such as Amazon Alexa have enabled applications that talk and listen to users, creating a natural and lifelike user interface. The pairing of Alexa and LLMs seems all to obvious: A thinking machine that can converse with its users.\n\nIn this session, we'll explore ways to bring LLMs to life with voice. We'll consider a handful of popular LLMs and see how to integrate them into a voice user experience offered by Alexa. You'll leave with a basic understanding of where the integration points are and hopefully be inspired to create amazing and unique user experiences."
}