{
  "id": "530691",
  "title": "Modern Web Automation Testing",
  "speakers": [
    {
      "id": "cb70d1bd-13ab-4a16-abfd-cf48b37ec30d",
      "name": "Bob Crowley",
      "photo": "https://sessionize.com/image/0f1c-400o400o1-bd-13ab-4a16-abfd-cf48b37ec30d.24b187ae-c9c9-4580-ad0e-ca856b8912ee.png",
      "bio": "Bob Crowley is a Software Engineer near Portland Maine where he builds solutions in the .NET ecosystem. He has been writing bugs for over $\"{DateTime.Now.Year - 2004} years\". He is on the organization committee for New Hampshire's Granite State Code Camp where he builds and operates a Capture the Flag competition for attendees. \n \n In his free time he likes to make the most of both weeks of Maine's summer either fishing out on the ocean or throwing discs at trees.\n \n Find Bob on LinkedIn as contrivedexample",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/contrivedexmple"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/contrivedexample"
        },
        {
          "title": "Blog",
          "url": "https://contrivedexample.com"
        },
        {
          "title": "Company Website",
          "url": "https://crowley.software"
        }
      ]
    }
  ],
  "room": "Salon A",
  "track": "Software Quality",
  "tags": [
    "Front End",
    "Automation",
    "QA Testing"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Thursday",
  "startTime": "13:00",
  "endTime": "14:00",
  "excerpt": "Modern web applications require a modern tool for automated testing. Something that can handle both mobile and desktop, async operations, shadow DOM, all the browsers and much more.\n\nEnter Playwright. Designed for all the needs of modern applications, Playwright checks all the boxes.\n\nThis session...",
  "description": "Modern web applications require a modern tool for automated testing. Something that can handle both mobile and desktop, async operations, shadow DOM, all the browsers and much more.\n\nEnter Playwright. Designed for all the needs of modern applications, Playwright checks all the boxes.\n\nThis session is all about getting to know how Playwright works and seeing its features in action. Features like Codegen to generate tests by recording user actions, the Inspector which allows you to step through detailed history, the Trace Viewer that captures detailed execution information, recording videos and screenshots and an overview of the API.\n\nDemos will use Typescript, but this cross platform tool also supports javascript, Python, .NET and Java.\n\nSo ditch those flaky tests, grab a tool that has all-inclusive features and enjoy reliable end-to-end testing for building robust web UI's.\n"
}