{
  "id": "531157",
  "title": "What is Your Working Genius? (Workshop)",
  "speakers": [
    {
      "id": "7949d43a-8944-4575-bad6-61b90c7c75a4",
      "name": "Kyle Jenkins",
      "photo": "https://sessionize.com/image/6c8e-400o400o1-fLkrnrZ1fd3PXZLwJEvj6T.jpg",
      "bio": "Kyle Jenkins is driven to help you ease the pain of work, whether it’s technology bleeding resources or trouble working with a team of people.  As a full stack developer, public speaker, and principal consultant with Improving, a global software development consulting and training company, he integrates into teams to provide quality software solutions and into the IT and Agile community to improve processes and teamwork. On the side, he is an avid video gamer, and loves correlating the challenges and learnings from video games to the world of work.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/kjenkinsdev"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/kyle-jenkins"
        }
      ]
    }
  ],
  "room": "Salon H",
  "track": "Teams & Collaboration",
  "tags": [
    "Soft Skills",
    "Leadership",
    "Teams"
  ],
  "format": "PreCompiler",
  "level": "Introductory and overview",
  "day": "Tuesday",
  "startTime": "8:00",
  "endTime": "12:00",
  "excerpt": "The working genius model is a productivity model developed by Patrick Lencioni with the goal of accomplishing a simple concept: bringing more joy and fulfillment at work! When you and your team understand where your geniuses are and how to (and when not to) use them, it can improve meetings, reduce...",
  "description": "The working genius model is a productivity model developed by Patrick Lencioni with the goal of accomplishing a simple concept: bringing more joy and fulfillment at work! When you and your team understand where your geniuses are and how to (and when not to) use them, it can improve meetings, reduce burnout, and dramatically reduce turbulence in getting projects done. In this workshop we will review the 6 types of working geniuses and how they bring projects from ideation to implementation. We will discover the hidden cause of burnout and how to keep meetings, including our agile ceremonies, more focused and more productive as a whole, all with the goal of improving your life and team culture, both in and outside of work. (that's right… ALL projects!)\n\nThis workshop will allow everyone to take the assessment at no cost. We will create teams and go over mock scenarios and go into depth on how this affects teamwork and dramatically reduce turbulent culture."
}