{
  "id": "531370",
  "title": "Platform as a Product: the future of Agile and DevOps",
  "speakers": [
    {
      "id": "a9b2a553-3146-434b-8995-002a84805074",
      "name": "Brad Nelson",
      "photo": "https://sessionize.com/image/3824-400o400o1-E8mARoxD3GMhcqyB2B2hPb.png",
      "bio": "Brad Nelson is an accomplished professional in the fields of product strategy and agility, currently lending his expertise to Ford Credit where he enhances digital experiences through data-driven insights, bolstering Ford's reputation as a pioneering force in the automotive industry. Possessing a versatile background spanning Lean Manufacturing to R&amp;D, developer to people leader, and an array of industries, technologies, and roles in-between, Brad takes great pride in his diverse skill set. With a well-established history of nurturing top-tier teams across these wide-ranging domains and industries, Brad enjoys guiding learners of all ages and experience, from youngsters to seasoned experts. A prolific content creator, Brad co-hosts The Agile For Agilists Podcast, frequently publishes articles, and boasts extensive experience as a public speaker.",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://linkedin.com/in/bradgile"
        },
        {
          "title": "Blog",
          "url": "https://www.agileforagilists.com/blog-posts-articles/"
        }
      ]
    }
  ],
  "room": "Indigo Bay",
  "track": "DevOps",
  "tags": [
    "Programming Principles",
    "DevOps",
    "Agile",
    "System Design"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Friday",
  "startTime": "9:45",
  "endTime": "10:45",
  "excerpt": "Cross-functional teams and full-stack developers have become the expectation in today's highest-performing teams. However, as technology needs become more complex and solutions begin to scale, it becomes increasingly difficult for software engineers to balance expertise across all layers of the...",
  "description": "Cross-functional teams and full-stack developers have become the expectation in today's highest-performing teams. However, as technology needs become more complex and solutions begin to scale, it becomes increasingly difficult for software engineers to balance expertise across all layers of the stack, operations, security, development tools, etc. This leads to an increased cognitive load for your engineers, resulting in lower performance, longer development times, decreased quality, and, ultimately, developer burnout. In this talk, we'll explore how applying Product Thinking to Platform Engineering can reduce this burden on your development teams while preventing organizational bottlenecks. Join this talk to learn what a platform is, what the product mindset is, and how to architect for enterprise flow."
}