{
  "id": "531443",
  "title": "Alerts Don't Suck. YOUR Alerts Suck.",
  "speakers": [
    {
      "id": "c8071b61-5b1f-432a-969f-d4aa1a4a9e59",
      "name": "Leon Adato",
      "photo": "https://sessionize.com/image/5ef2-400o400o1-Wnp9b7SsKHDSRyP44XJRgA.png",
      "bio": "Leon Adato is a Developer Relations Advocate and has held multiple industry certifications over his 33 years in IT including Cisco, Microsoft, A+, and more. His experience spans financial, healthcare, food and beverage, and other industries.\n \n Leon has been speaking, blogging, and creating content in the monitoring and observability space for almost a decade. His expertise in IT began in 1989 and has led him through roles in classroom training, desktop support, server support, network engineering and systems automation before landing in monitoring and observability over 25 years ago.",
      "links": [
        {
          "title": "Twitter",
          "url": "http://www.twitter.com/leonadato"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/leonadato/"
        },
        {
          "title": "Blog",
          "url": "https://adatosystems.com"
        },
        {
          "title": "Company Website",
          "url": "https://adatosystems.com"
        }
      ]
    }
  ],
  "room": "Nile",
  "track": "DevOps",
  "tags": [
    "Observability"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Thursday",
  "startTime": "16:45",
  "endTime": "17:45",
  "excerpt": "The SRE handbook defines alerts as \"A notification intended to be read by a human and that is pushed to a system such as a bug or ticket queue, an email alias, or a pager. Respectively, these alerts are classified as tickets, email alerts, and pages.\" and I just want to scream. Not because the...",
  "description": "The SRE handbook defines alerts as \"A notification intended to be read by a human and that is pushed to a system such as a bug or ticket queue, an email alias, or a pager. Respectively, these alerts are classified as tickets, email alerts, and pages.\" and I just want to scream. Not because the definition is wrong, but because it's not enough.\n\nFirst off, if you go from that definition, many devs think (and rightly so) \"Why bother?\". Who wants an unscheduled interruption when there's no intrinsic value. Because, you might notice, the value of the alert is completely missing.\n\nSecond, and conversely, many practitioner see alerting is seen as the entire reason for monitoring and observability. If you can’t get an alert when something is going wrong, why bother monitoring at all?\n\nBut those of us who revel in the I.T. sub-discipline of monitoring and observability know that alerts are only one piece of the puzzle. Drawing on decades of experience designing, building, implementing, and supporting solutions from a range of vendors in a variety of  settings, I'll expose the places where alerting often goes wrong, how to avoid common pitfalls, and how to dig yourself out if you're already neck-deep."
}