{
  "id": "531432",
  "title": "From IC to EM: How to Know if Management is Right for You",
  "speakers": [
    {
      "id": "3d63b9d6-c06e-48f3-b1a2-ef8dffe5d374",
      "name": "Andrea Rhodes",
      "photo": "https://sessionize.com/image/055f-400o400o1-KumDbna5YvMSsKnW2kYH7v.jpg",
      "bio": "Andrea has over 10 years of experience within the management space. Her career path has certainly been a twisty one, to say the least. Starting off with a degree in English, she wound her way through technical writing in the manufacturing engineering industry, through to technical writing for a SaaS company, then a turn into change &amp; release management, eventually leading her to Engineering Management where she currently works within the Commerce Platform space at Stitch Fix. In her free time, Andrea likes to spend time playing board games with her family, attending theater productions with her daughter, and reading psychological thriller books that she swears don’t keep her up at night.",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/abrhodes/"
        }
      ]
    }
  ],
  "room": "Orange",
  "track": "Career Development",
  "tags": [
    "Career Development",
    "Leadership",
    "Teams"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Thursday",
  "startTime": "11:45",
  "endTime": "12:45",
  "excerpt": "“What do I want to be when I grow up?” This isn’t something that we only ask our younger-selves, but our older-selves as well. At some point in your career, you’ve probably been asked: “Have you thought about growing into the people management area?” If you have (or even if you...",
  "description": "“What do I want to be when I grow up?” This isn’t something that we only ask our younger-selves, but our older-selves as well. At some point in your career, you’ve probably been asked: “Have you thought about growing into the people management area?” If you have (or even if you haven’t), and you weren’t sure how to start to think about answering this question, then this session is for you!\n\nThis session will go over 12 signs that you’re ready for a management position (and 12 signs that maybe you aren’t) and what to expect when saying “yes” to an Engineering Manager position. Ultimately, this session will help give you an answer to the question: “Is a people manager what I want to be when I grow up?”"
}