{
  "id": "531557",
  "title": "Async/Await from the Ground Up",
  "speakers": [
    {
      "id": "d89757e0-5589-4400-935e-b57bdef01799",
      "name": "Stephen Cleary",
      "photo": "https://sessionize.com/image/f33f-400o400o1-e0-5589-4400-935e-b57bdef01799.a49d26c0-725a-4174-b920-8f7371296575.jpg",
      "bio": "Stephen Cleary is a family man who feels like he does software development in his spare time. :)\n \n He is a Microsoft MVP and the author of \"Concurrency in C# Cookbook\" (O'Reilly) on asynchronous and parallel programming, as well as several MSDN articles. He's the top async/await answerer on Stack Overflow, he's assisted hundreds of companies with async adoption across all kinds of applications, his blog has been the go-to source for async advice for years, he contributed some of the MS documentation on subjects such as ValueTask, and he's the maintainer of AsyncEx, a library with &gt;25M downloads which provides asynchronous coordination primitives and other async helper types.\n \n He published a .NET-oriented version of the classic TCP/IP FAQ on his blog almost 15 years ago, and has helped countless developers debug their application protocols. At his first job ever, he ended up fixing the primary protocol used in all their systems as well as implementing a TCP/IP replacement for an old serial protocol, and at another job he designed and implemented a multiplexed streaming protocol for embedded devices from scratch. More recently, he recorded a YouTube series where he live-coded a fully asynchronous chat-like TCP/IP protocol using modern .NET pipelines and channels.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/aSteveCleary"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/astevecleary/"
        },
        {
          "title": "Blog",
          "url": "https://stephencleary.com"
        }
      ]
    }
  ],
  "room": "Cypress",
  "track": "Programming Principles",
  "tags": [
    ".NET",
    "C#",
    "Code Quality"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Thursday",
  "startTime": "10:30",
  "endTime": "11:30",
  "excerpt": "An async refresher course for developers who use async and await but want to really understand what's going on.\n\nThis session is a \"re-introduction\" to async and await. It covers what the keywords mean and - just as importantly - what they *don't* mean. We'll be covering What You Need To Know,...",
  "description": "An async refresher course for developers who use async and await but want to really understand what's going on.\n\nThis session is a \"re-introduction\" to async and await. It covers what the keywords mean and - just as importantly - what they *don't* mean. We'll be covering What You Need To Know, including several different conceptual models of async/await that you can switch between at will. This refresher course will take a look at the common async best practices with a careful examination of why they're best practices and when to ignore the best practices. We'll be including some semi-advanced topics (specifically ValueTasks, asynchronous disposal, and Channels) to round out techniques for modern asynchronous development.\n\nWhile this talk is geared towards developers who already use async and await, it would also be appropriate for those who do not (yet). Feel free to bring questions!"
}