{
  "id": "531608",
  "title": "Reasonable Accommodations in the Workplace",
  "speakers": [
    {
      "id": "a9f6a949-c457-482d-b321-b0c6849fecec",
      "name": "Erissa Duvall",
      "photo": "https://sessionize.com/image/07cb-400o400o1-KGDwzfQ7z8yGzyqkWfjoNm.jpg",
      "bio": "I gained my Accessibility knowledge after a little over 3 years in the IT Department at the American Printing House for the Blind (APH) here in Louisville, KY. While there, I was always looking to provide accessible technology training, help implement more Accessible technology options, and learn everything I could to help others.\n \n Eventually, I moved on to more development oriented roles, including a QA role with GoodMaps, an accessible indoor navigation app developer born out of APH. Now, I work as an Accessibility Engineer with CVS. I hope to continue to build my career on Accessibility while also spreading what I learn to as many people as possible.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/TheCorgiDev"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/corgidev/"
        },
        {
          "title": "Blog",
          "url": "Https://corgidev.com"
        },
        {
          "title": "Company Website",
          "url": "https://corgidev.com"
        }
      ]
    }
  ],
  "room": "Salon D",
  "track": "Career Development",
  "tags": [
    "Diversity/Equity/Inclusion",
    "Accessibility"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Thursday",
  "startTime": "9:15",
  "endTime": "10:15",
  "excerpt": "Reasonable Accommodations can be a life saver for so many. They can be the difference between struggling to accomplish work tasks and flourishing. They can also benefit more people than you may realize. \n\nWhat kinds of things could be considered workplace accommodations? What might you need to do to...",
  "description": "Reasonable Accommodations can be a life saver for so many. They can be the difference between struggling to accomplish work tasks and flourishing. They can also benefit more people than you may realize.\n\nWhat kinds of things could be considered workplace accommodations? What might you need to do to ask for an accommodation or to provide one?\n\nI am not a legal expert, but I'll share my experiences with requesting / supporting reasonable accommodation requests to give you a starting point. I want to help you help yourself and/or others be more productive and feel more welcome through reasonable accommodations."
}