{
  "id": "531711",
  "title": "The Hazards of Sitting: An Osteopath’s Approach to Preventing Work-Related Injury.",
  "speakers": [
    {
      "id": "b4b9d0ac-4135-4e89-804c-3b3ce22082c7",
      "name": "Michele Parsley-Lanning D.O.",
      "photo": "https://sessionize.com/image/c82a-400o400o1-aXQvgnGkb17Qre913sLeSV.jpeg",
      "bio": "After completing both a Java Full Stack Web Development and Data Analytics Bootcamp through Tech Talent South in 2019, I accepted a full-time position at CAS (Chemical Abstracts Service). \n \n Prior to working with CAS, I was an Internal Medicine Physician but I decided to make a change career to technology. I hold a degree in Osteopathic Medicine (DO)  from Ohio University Heritage College of Osteopathic Medicine and a BA Biology with a Biomedical Science Concentration with a Chemistry Minor.\n \n In my spare time, I enjoy spending time with my husband, Wes and our two parrots: Willie and Bob as well as bird watching, hiking, baking, volunteering and hockey. Let's go CBJ!",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/michele-parsley-lanning-d-o-6ab030a5/"
        },
        {
          "title": "Company Website",
          "url": "https://www.cas.org/"
        }
      ]
    }
  ],
  "room": "Salon H",
  "track": "Career Development",
  "tags": [
    "Soft Skills",
    "Leadership"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Thursday",
  "startTime": "16:45",
  "endTime": "17:45",
  "excerpt": "My training as an Osteopathic Physician prepared me to counsel my patients about  injury and disease prevention. However, I did not realize the full impact of spending a majority of my time sitting at a desk would have on my overall movement and flexibility. \n\nIn this talk, I will provide background...",
  "description": "My training as an Osteopathic Physician prepared me to counsel my patients about  injury and disease prevention. However, I did not realize the full impact of spending a majority of my time sitting at a desk would have on my overall movement and flexibility.\n\nIn this talk, I will provide background education on the most common injuries software engineers are at risk to develop and how I try to prevent these by implementing a few simple measures daily at work.\n\nSome of the measures include proper chair/desk/monitor adjustment, workspace setup, stretching routine that can be easily implemented at your desk and much more."
}