{
  "id": "531729",
  "title": "The Legend of CodeMash",
  "speakers": [
    {
      "id": "96ea86eb-7f1f-4c85-b2b8-98d462a40c94",
      "name": "Christopher Judd",
      "photo": "https://sessionize.com/image/bd3c-400o400o1-D3KXQY9QPCWy3KUFJ6twgd.jpg",
      "bio": "Christopher Judd is CTO and partner at Manifest Solutions (http://www.manifestcorp.com), an international speaker, Java Champion, an open source evangelist, and the Central Ohio Java Users Group (http://www.cojug.org) leader.&nbsp; He is an accomplished writer having co-authored Beginning Groovy and Grails (Apress, 2008), Enterprise Java Development on a Budget (Apress, 2003) and Pro Eclipse JST (Apress, 2005) as well as the author of the children’s book “Bearable Moments”.&nbsp; Based in Columbus Ohio, he has spent over 20 years architecting and developing software for organizations ranging from Fortune 500 to start-ups across various industries including insurance, health care, education, retail, government, manufacturing, service, and transportation.&nbsp; Mr. Judd spends most of his time consulting while continuing to focus on mentoring and training in Java, mobile and related technologies.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/javajudd"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/christophermjudd/"
        },
        {
          "title": "Blog",
          "url": "https://javajudd.net"
        },
        {
          "title": "Company Website",
          "url": "https://manifestcorp.com/"
        }
      ]
    }
  ],
  "room": "Portia / Wisteria",
  "track": "KidzMash",
  "tags": [
    "Javascript"
  ],
  "format": "KidzMash Divez",
  "level": "",
  "day": "Wednesday",
  "startTime": "13:30",
  "endTime": "15:30",
  "excerpt": "In 1986, the iconic fantasy action-adventure game, The Legends of Zelda, was released to the fanfare of video gamers across the globe. Everybody loved the 2D quests that Link would go on to rescue Princess Zelda. In 2024, it is your turn to create a classic, The Legends of CodeMash, video game. In...",
  "description": "In 1986, the iconic fantasy action-adventure game, The Legends of Zelda, was released to the fanfare of video gamers across the globe. Everybody loved the 2D quests that Link would go on to rescue Princess Zelda. In 2024, it is your turn to create a classic, The Legends of CodeMash, video game. In this session, you will learn basic gaming techniques and strategies using the Phaser.io open source, HTML5, and JavaScript gaming framework to create your quests and rescue the Prince, Brian Prince."
}