{
  "id": "531780",
  "title": "K3s - Half the Size, Twice as Awesome: Lightweight Kubernetes",
  "speakers": [
    {
      "id": "0454c845-d430-4121-b51d-6688efca31ad",
      "name": "Chris Houdeshell",
      "photo": "https://sessionize.com/image/5845-400o400o1-45-d430-4121-b51d-6688efca31ad.1fa4d352-67ba-4953-83b8-2332b74593ec.png",
      "bio": "As Vice President of Engineering and Operations at EnergyCAP LLC, Chris is a driving force behind the company's research and technology innovation initiatives. With a deep passion for emerging technologies, Chris is committed to keeping EnergyCAP at the forefront of its industry.\n \n What sets Chris apart as a leader is his people-first approach. He believes that technology should serve people and businesses, and he fosters an environment of positivity and professional development. Chris is known for his effective leadership style, which is characterized by positive reinforcement, support, and a hug.\n \n Under Chris's leadership, EnergyCAP has experienced tremendous success, thanks in large part to his innovative thinking and ability to inspire his team. With a track record of driving results and a dedication to creating a positive and rewarding work environment, Chris is a valuable asset to any organization looking to stay ahead of the curve.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/choudeshell"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/choudeshell"
        },
        {
          "title": "Blog",
          "url": "https://www.choudeshell.com"
        }
      ]
    }
  ],
  "room": "Salon H",
  "track": "DevOps",
  "tags": [
    "DevOps"
  ],
  "format": "PreCompiler",
  "level": "Introductory and overview",
  "day": "Tuesday",
  "startTime": "13:00",
  "endTime": "17:00",
  "excerpt": "Are you ready to conquer the Kubernetes learning curve without the pain?\n\nEmbarking on a Kubernetes journey can be intimidating. Many have endured the steep initial challenges only to find the eventual rewards. But what if we told you there's a way to make that initial climb smoother? What if you...",
  "description": "Are you ready to conquer the Kubernetes learning curve without the pain?\n\nEmbarking on a Kubernetes journey can be intimidating. Many have endured the steep initial challenges only to find the eventual rewards. But what if we told you there's a way to make that initial climb smoother? What if you could dive in, gain hands-on experience, and build a production-ready Kubernetes environment without the typical complexity?\n\nIntroducing K3s – the lightweight Kubernetes distribution that's set to revolutionize your Kubernetes experience.\n\nJoin us in this immersive workshop, where we'll not only dip our toes into Kubernetes but also emerge with a fully-fledged, production-ready Kubernetes instance. It's time to unlock the power of Kubernetes without the usual hurdles. Let's make Kubernetes accessible and enjoyable for all. Don't miss out on this opportunity to revolutionize your Kubernetes journey with K3s!\n"
}