{
  "id": "531983",
  "title": "self.clone();//Passing On Your Passion",
  "speakers": [
    {
      "id": "8df97796-8644-4bb5-82e3-103a3c34138c",
      "name": "Barry Tarlton",
      "photo": "https://sessionize.com/image/bc22-400o400o1-hqw5H5nK19pVJDJZKDGAi3.png",
      "bio": " Barry is passionate about learning, problem solving, and teaching.  He believes that software developers are problem solvers at heart and the languages and platforms we work with are simply the tools in our utility belts.  Barry can often be found trying to inspire and educate others both inside and outside of work. Whether he's MacGyver'ing IOT solutions together or leading a hackathon team, he loves innovating and constantly trying new things.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/btarlton"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/barry-tarlton-5816345/"
        }
      ]
    }
  ],
  "room": "Salon H",
  "track": "Career Development",
  "tags": [
    "Career Development",
    "Soft Skills",
    "Code Quality"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Thursday",
  "startTime": "15:30",
  "endTime": "16:30",
  "excerpt": "When you've written your last line of code, what will be your legacy?  Will your applications live on forever in Production or at least until AI takes over?  Will your Github repos be archived and immortalized?  Will there be patterns or tools named after you?  For most of us, there probably won't...",
  "description": "When you've written your last line of code, what will be your legacy?  Will your applications live on forever in Production or at least until AI takes over?  Will your Github repos be archived and immortalized?  Will there be patterns or tools named after you?  For most of us, there probably won't be great fame or fanfare about our amazing contributions to digital environments.  However, while using software to creatively solve real world problems is exhilarating, creating someone else who can do the same is an even more rewarding experience.  In this session, we will talk about how to pass on our passion for problem solving with code to the next generation.  Whether you are a relative noob with little experience or a seasoned veteran with decades of crusty code under your belt, we will learn the importance and how-to of uplifting the nerds of the future. CLONE THINESELF!\n"
}