{
  "id": "532476",
  "title": "Building a Full-Stack Application with Flutter and Dart",
  "speakers": [
    {
      "id": "a905b162-d48e-4338-a769-edab94365267",
      "name": "Ryan Edge",
      "photo": "https://sessionize.com/image/37bb-400o400o1-UgkAsAjTbiPUhAmYgLSyzF.jpg",
      "bio": "Ryan Edge is a software engineer and Flutter GDE living in Charlotte, North Carolina.  His primary focus is front-end mobile and web development using Flutter and React. His secondary focus is back-end development with technologies including Node.js, GraphQL, Vercel, Supabase, and Firebase.  He is a co-author of the \"Cross-Platform UIs with Flutter\" book.\n \n Ryan Edge has 10+ years of experience ranging from maintaining large-scale systems to developing internal and commercial web, mobile, and desktop applications using various technologies.\n \n Ryan Edge is a community organizer of Flutter Charlotte and GDG Charlotte. He is passionate about creating software that has a tangible positive impact on the lives of its users, furthering diversity in the developer community, and mentoring young software engineers.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/chimon1984?t=gW9O4IWmo93sJoq1hA7cfg&s=09"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/ryan-edge"
        },
        {
          "title": "Blog",
          "url": "https://poetryincode.dev/"
        }
      ]
    }
  ],
  "room": "Salon E",
  "track": "Mobile",
  "tags": [
    "Front End",
    "Mobile",
    "Cloud"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Thursday",
  "startTime": "9:15",
  "endTime": "10:15",
  "excerpt": "For the past few years, Flutter has revolutionized mobile app development by allowing developers to build high-performance, cross-platform applications with ease. However, building a full-stack application can be a challenging task because we often find ourselves juggling multiple technologies to...",
  "description": "For the past few years, Flutter has revolutionized mobile app development by allowing developers to build high-performance, cross-platform applications with ease. However, building a full-stack application can be a challenging task because we often find ourselves juggling multiple technologies to solve problems across an application stack.\n\nIn this talk, we will explore how to build a full-stack application using Flutter and Dart Frog.\n\nDart Frog is a backend framework that, when coupled with Flutter, allows developers to build full-stack applications using a single programming language. By leveraging the power of Flutter for the front-end and Dart Frog for the backend, developers can build high-performance applications with ease.\n\nWe will start by introducing the basics of Flutter and Dart Frog and their key features. We will then dive into building a full-stack application, starting with the front-end using Flutter, and then moving onto the backend using Dart Frog. We will cover topics such as handling user authentication, building RESTful APIs, and using a database to store data.\n\nThroughout the talk, we will also discuss best practices for building full-stack applications and how to ensure that your application is scalable and maintainable. We will also highlight the advantages of using Flutter and Dart Frog together, including reduced development time and increased developer productivity.\n\nBy the end of the talk, attendees will have a solid understanding of how to build a full-stack application using Flutter and Dart Frog. They will also have learned best practices for building scalable and maintainable applications, as well as the benefits of using Flutter and Dart Frog together."
}