{
  "id": "532574",
  "title": "Revolutionizing Business Processes with Power Automate RPA",
  "speakers": [
    {
      "id": "e4808bf3-8fc2-43e5-b9d0-303f77f43547",
      "name": "Barret Blake",
      "photo": "https://sessionize.com/image/0d94-400o400o1-Dc7G7MqgRQdxCvhDFwtvfL.png",
      "bio": "Microsoft MVP, husband, father, solutions architect, manager, developer, gamer, Buckeyes fan, model railroader, board member of JavaScript &amp; Friends conference. When I'm not doing all that other stuff I also occasionally develop applications.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/BarretBlake"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/barretblake"
        },
        {
          "title": "Blog",
          "url": "https://barretblake.dev"
        },
        {
          "title": "Company Website",
          "url": "https://www.cgi.com/en"
        }
      ]
    }
  ],
  "room": "Salon G",
  "track": "DevOps",
  "tags": [
    "DevOps",
    "Automation"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Friday",
  "startTime": "11:00",
  "endTime": "12:00",
  "excerpt": "We all have to deal with them, those legacy desktop applications that are too important to get rid of, but not important enough to replace, the kind of application where someone has to open it up and click a few buttons a couple times a day. \n\nRobotic Process Automation (RPA) is transforming the way...",
  "description": "We all have to deal with them, those legacy desktop applications that are too important to get rid of, but not important enough to replace, the kind of application where someone has to open it up and click a few buttons a couple times a day.\n\nRobotic Process Automation (RPA) is transforming the way businesses operate, letting us automate those ridiculous legacy app processes. And Power Automate RPA is at the forefront of this revolution. In this talk, we'll explore the features and capabilities of Power Automate RPA and show how it can be used to automate repetitive and time-consuming tasks with those legacy applications. From automating legacy applications, to reducing errors, to increasing efficiency, we'll cover the benefits of RPA and demonstrate how Power Automate RPA can be used to improve business processes.\n\nWhether you're a business leader, IT professional, or developer, this talk will provide valuable insights and best practices for leveraging Power Automate RPA to drive innovation and growth in your organization."
}