{
  "id": "533070",
  "title": "Mastering TDD in Legacy Code",
  "speakers": [
    {
      "id": "1dbfb6bc-c1f2-44af-9294-3614597b165e",
      "name": "Brendan Enrick",
      "photo": "https://sessionize.com/image/ff1e-400o400o1-Nhbh9sAeXRqYKpaBuHA3Tq.png",
      "bio": "I've been speaking about coding for over a decade. Everything changes, but everything is the same. \n \n I write code to solve problems, and I try to leave things nicer than I found them. I have fun while doing it. Let's write code and talk about code together!",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/brendoneus"
        },
        {
          "title": "Blog",
          "url": "http://brendan.enrick.com/"
        }
      ]
    },
    {
      "id": "a5d50f4e-f021-4983-97a9-73f9415b3d5b",
      "name": "Steve Smith",
      "photo": "https://sessionize.com/image/2328-400o400o1-4e-f021-4983-97a9-73f9415b3d5b.34dc742e-9a1e-4c87-98ad-c6bae9a07972.jpg",
      "bio": "Steve Smith (@ardalis) is an entrepreneur and software developer with a passion for building quality software as effectively as possible. Steve has published several courses on Pluralsight, covering DDD, SOLID, design patterns, and software architecture. He's a Microsoft ASP.NET MVP and Insider, a frequent speaker at developer conferences, an author, and a trainer.\n \n Steve works with companies that want to avoid the trap of technical debt by helping their teams deliver quality software, quickly. Steve and his team have been described by clients as a \"force multiplier\", amplifying the value of existing development teams. Steve's client list includes Microsoft, Quicken Loans, Celina Insurance, and many other satisfied customers.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/ardalis"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/stevenandrewsmith"
        },
        {
          "title": "Blog",
          "url": "https://ardalis.com/blog"
        },
        {
          "title": "Company Website",
          "url": "https://nimblepros.com"
        }
      ]
    }
  ],
  "room": "Salon A",
  "track": "Software Quality",
  "tags": [
    "Code Quality"
  ],
  "format": "PreCompiler",
  "level": "Intermediate",
  "day": "Wednesday",
  "startTime": "13:00",
  "endTime": "17:00",
  "excerpt": "In this hands-on workshop, you’ll learn to effectively use the principles and practices of increasing the reliability and maintainability of your code through testing and pair programming. You’ll sharpen your skills working with your peers on programming exercises designed to instill good...",
  "description": "In this hands-on workshop, you’ll learn to effectively use the principles and practices of increasing the reliability and maintainability of your code through testing and pair programming. You’ll sharpen your skills working with your peers on programming exercises designed to instill good practices that you’ll be ready to apply to non-trivial codebases.\n\nAttendees should be comfortable with a programming language of their choice, and if possible should bring along a laptop with their development tools installed, including a unit test tool. This session will focus on group/pair design, refactoring, and application of design patterns to improve the design of existing software.\n\nBoth beginners and experienced developers and from all backgrounds are welcome."
}