{
  "id": "533074",
  "title": "Not Your Mother's or Father's C#",
  "speakers": [
    {
      "id": "1dbfb6bc-c1f2-44af-9294-3614597b165e",
      "name": "Brendan Enrick",
      "photo": "https://sessionize.com/image/ff1e-400o400o1-Nhbh9sAeXRqYKpaBuHA3Tq.png",
      "bio": "I've been speaking about coding for over a decade. Everything changes, but everything is the same. \n \n I write code to solve problems, and I try to leave things nicer than I found them. I have fun while doing it. Let's write code and talk about code together!",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/brendoneus"
        },
        {
          "title": "Blog",
          "url": "http://brendan.enrick.com/"
        }
      ]
    }
  ],
  "room": "Cypress",
  "track": "Programming Principles",
  "tags": [
    ".NET",
    "C#"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Thursday",
  "startTime": "9:15",
  "endTime": "10:15",
  "excerpt": "Gone are the days of verbose C# code and having only one way to solve a problem. In recent updates, C# has been adapting ideas from other programming paradigms, including functional programming. Some of the most recent ones have significantly changed the appearance of C# code. We'll see what you...",
  "description": "Gone are the days of verbose C# code and having only one way to solve a problem. In recent updates, C# has been adapting ideas from other programming paradigms, including functional programming. Some of the most recent ones have significantly changed the appearance of C# code. We'll see what you think after this session!\n\nWhether you're using C# every day, or you haven't looked at the language in a while, this fast-paced session will show you what has been changing in the C# world.\n\nUnlike the classic \"coming soon\" session where you can't take what you learn home and apply it, you can take what you learn here back home to remove redundant code, streamline your classes, and add flexible type constraints. This is a fun, fast-paced session that will provide you with the insight you need to make the changes you want in your code."
}