{
  "id": "533412",
  "title": "Watch this! Building a Health app for Wear OS",
  "speakers": [
    {
      "id": "8500ffde-a07d-40ad-8c9f-e35b97359bee",
      "name": "Sierra OBryan",
      "photo": "https://sessionize.com/image/715b-400o400o1-71xKbc39LZi6tkVP2BZH6K.png",
      "bio": "Sierra is a Software Engineer at Clubhouse, based in Cincinnati, OH, USA, focused primarily on native Android. She loves building beautiful and accessible Android apps, sharing knowledge with the community, and mentoring aspiring mobile developers. She is a Google Developer Expert for Android and serves as a Director of Women Who Code Cincinnati, Director of Technology for getWITit (Women in Tech), Women Techmakers global Ambassador, and former global Leadership Fellow for Women Who Code Mobile.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/_sierraobryan"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/sierraobryan/"
        },
        {
          "title": "Blog",
          "url": "https://sierraobryan.dev/"
        }
      ]
    }
  ],
  "room": "Salon B",
  "track": "Mobile",
  "tags": [
    "Hardware",
    "Mobile"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Friday",
  "startTime": "11:00",
  "endTime": "12:00",
  "excerpt": "One of the most popular answers for a favorite smart watch feature is to monitor your health. From steps to heart rate to exercise to sleep, smart watches do it all and with Jetpack Compose and Health Services, we can build our own app for Wear OS!\n\nDuring this talk, we’ll explore building for...",
  "description": "One of the most popular answers for a favorite smart watch feature is to monitor your health. From steps to heart rate to exercise to sleep, smart watches do it all and with Jetpack Compose and Health Services, we can build our own app for Wear OS!\n\nDuring this talk, we’ll explore building for this tiny screen using Compose for Wear OS, a declarative framework for creating watch interfaces quickly and easily optimized for the screen shape and size, and the Health Services APIs, an intermediary to the various sensors and algorithms on the the watch that provide data related to activity, exercise, and health. With these tools, we’ll be able to create a beautiful and efficient wear app that can help you track your health goals!"
}