{
  "id": "533604",
  "title": "Dev Containers. What are they and why do you need them?",
  "speakers": [
    {
      "id": "137fb55c-d120-4a6b-9e15-98123df17302",
      "name": "Joseph Guadagno",
      "photo": "https://sessionize.com/image/a114-400o400o1-3tev7cMVvNUmgJZveNqbpX.png",
      "bio": "Joe Guadagno has been writing software for over 20 years, has been an active member of the .NET community,\n serving on the .NET Foundation Board of Directors, as President and has been a Microsoft MVP in .NET for more than 14 years.  He has spoken through the United States and at international events on topics ranging from Microsoft .NET, Microsoft Azure, Ionic, Bootstrap, and many others. You can see the complete list at https://www.josephguadagno.net/presentations. When not sitting at a computer Joe loves to hang out with his family and play games. When not playing games with the family, Joe is checking out the latest in Home Automation. You can connect with Joe on Twitter at @jguadagno, Facebook at JosephGuadagnoNet, and on his blog at https://www.josephguadagno.net.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://www.twitter.com/jguadagno"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/josephguadagno/"
        },
        {
          "title": "Blog",
          "url": "https://www.josephguadagno.net"
        },
        {
          "title": "Company Website",
          "url": "https://www.josephguadagno.net"
        }
      ]
    }
  ],
  "room": "Nile",
  "track": "DevOps",
  "tags": [
    ".NET",
    "DevOps",
    "CI/CD"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Thursday",
  "startTime": "13:00",
  "endTime": "14:00",
  "excerpt": "You're onboarding a new team member, or your team recently inherited a project that uses a different SDK/framework version than your current project uses. What do you do?  Install the old SDK/framework versions? Can they even be installed at the same time on the same machine?  What if I told you...",
  "description": "You're onboarding a new team member, or your team recently inherited a project that uses a different SDK/framework version than your current project uses. What do you do?  Install the old SDK/framework versions? Can they even be installed at the same time on the same machine?  What if I told you there was a way to accomplish this with little to no effort on your part?  Well, with Visual Studio Code, Docker, and the Dev Containers extension, you can.  Dev containers can help you easily on-board new people to your projects, allow for cleaner machines with greater support for multiple SDKs/Framework, and be able to develop/debug/run your solution from anywhere without Visual Studio Code. Oh, and put an end to \"It works on my machine\"\n\nIn this talk, I’ll walk through how you can set up a dev container to support your application development, without installing the SDK/framework on your machine. I’ll show you how to get started and how you can solve the age-old problem of “It works on my machine!”.  As a bonus, if your code is hosted on GitHub, I’ll show you how you can run/edit/debug your project right from GitHub.com without Visual Studio Code on your machine.\n"
}