{
  "id": "534207",
  "title": "The Micro-Frontend Playbook",
  "speakers": [
    {
      "id": "2f50574a-7522-4a6f-a729-b4c99e3114d7",
      "name": "Marko Skugor",
      "photo": "https://sessionize.com/image/616e-400o400o1-UKoHKGPDLHgsX7R29D7YoZ.jpg",
      "bio": "Hi, I'm Marko Skugor and I love front end! I have over a decade of experience in the industry ranging from full stack development to specializing in design systems, accessibility, and frontend architecture. I've helped modernize applications across a wide variety of industries, and believe that investment in UX research is the most valuable choice any company can make. In my free time I like to hang out with my 3 cats and do nerd stuff in beautiful sunny Columbus, OH.",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/marko-skugor-399a98119/"
        },
        {
          "title": "Blog",
          "url": "https://medium.com/@markoskugor"
        },
        {
          "title": "Company Website",
          "url": "https://www.insight.com/en_US/solve/digital-innovation.html"
        }
      ]
    }
  ],
  "room": "Salon A",
  "track": "Web/Front-End",
  "tags": [
    "Javascript",
    "Front End",
    "Cloud",
    "Architecture"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Friday",
  "startTime": "14:45",
  "endTime": "15:45",
  "excerpt": "Micro-frontend architecture can provide a lot of great benefits to team autonomy and can play a crucial role in enabling technical and organizational scalability. At the same time, it also comes with a lot of potential pitfalls and anti-patterns to avoid. In this talk we'll learn how to apply Domain...",
  "description": "Micro-frontend architecture can provide a lot of great benefits to team autonomy and can play a crucial role in enabling technical and organizational scalability. At the same time, it also comes with a lot of potential pitfalls and anti-patterns to avoid. In this talk we'll learn how to apply Domain Driven Design concepts to the front-end of an application as well as several techniques for splitting up a monolithic web application into smaller independently deployable parts. From composition, caching, routing, state management, authentication &amp; communication patterns all the way to test automation strategy, we'll go over some practical approaches and some \"gotchas\" to avoid if you are considering micro-frontend architecture for your organization."
}