{
  "id": "534330",
  "title": "The Subtle Art of Communication",
  "speakers": [
    {
      "id": "f5db9d74-f6da-4fd5-9708-1392384e8b12",
      "name": "Natalie Hylton",
      "photo": "https://sessionize.com/image/04c5-400o400o1-KSi4gXBPy3oZqrTaFFTKQ7.jpg",
      "bio": "Meet Natalie, an impostor extraordinaire who came to banking infrastructure technology with a degree in linguistics and background in journalism… and turned her temporary gig into a 15-year long career. Her experience spans four countries, five cities and two continents.  Throughout her career she has been mastering the the art of creating relationships with people and inspiring them to grow and be the best of themselves.  Natalie loves trying new things (skijoring is next). She is a world traveler, board game geek, an active mother of three+stepmother of two, and a proud owner of an imaginary cat. The things that make her happy are people and her insatiable passion for learning. She combines every interaction and every experience into a broad picture of WHY we do things the way we do and HOW we can use this knowledge to make our lives, and the world, better.",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/natalie-hylton"
        }
      ]
    },
    {
      "id": "c53b081c-6035-47f5-a606-91e83963556b",
      "name": "Tristan Chiappisi",
      "photo": "https://sessionize.com/image/1756-400o400o1-wVXn5eUAhC5VwVcL9T1nhb.jpg",
      "bio": "With over a decade and a half of programming and working with data, I have a passion for anything related to the subject. If it has something to do with technology, I'm in.\n \n Beyond my professional realm, I'm a dad to a vibrant crew of young adventurers. Together, we seek out outdoor thrills, from skiing to biking, in my perpetual quest to earn the 'cool dad' badge.",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/tristanchiappisi/"
        }
      ]
    }
  ],
  "room": "Orange",
  "track": "Teams & Collaboration",
  "tags": [
    "Soft Skills",
    "Leadership",
    "Teams"
  ],
  "format": "PreCompiler",
  "level": "Intermediate",
  "day": "Wednesday",
  "startTime": "13:00",
  "endTime": "17:00",
  "excerpt": "We probably don't need this session. Technologists are excellent communicators, aren’t they? But for those who would like to learn (and practice) a new thing or two, here is a session packed with experiential learning. Amongst the things that we will cover:\n•\tCommunication styles (assessment...",
  "description": "We probably don't need this session. Technologists are excellent communicators, aren’t they? But for those who would like to learn (and practice) a new thing or two, here is a session packed with experiential learning. Amongst the things that we will cover:\n•\tCommunication styles (assessment included) and the best approach for each\n•\tSelling your idea: how to appeal to different sides of the Rhetoric Triangle\n•\tThe components of an effective message and how to use them to structure and deliver one\n•\tMore subtle (and sometimes more impactful!) aspects of communication like body language, semantics, active listening, empathy and more\n•\tBONUS: Tools and techniques that will help you become a star conversationalist (the ones that talk show hosts, interrogators and negotiators use ;-)\nThe entire experience will be packed with practical exercises that will make you step out of your comfort zone and have fun doing it!"
}