{
  "id": "534517",
  "title": "Scaling your .NET app with Azure",
  "speakers": [
    {
      "id": "3f01a9fa-4c71-4efe-871f-8e0ced1471d0",
      "name": "Callum Whyte",
      "photo": "https://sessionize.com/image/9c36-400o400o1-UVs9qJnM6fRNiA7Xc8wBpa.jpg",
      "bio": "Callum Whyte is a x4 Microsoft MVP and x6 Umbraco MVP specialising in building robust scalable solutions on Azure and the .NET stack, as well as websites with the open-source Umbraco CMS.\n \n Away from his desk you can find him organising community events; from local meetups and hackathons, to global conferences and roadshows. He’s an active contributor to open source projects, a regular speaker at events all over the world, as well as co-host of a weekly YouTube series “UmbraCoffee”!",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/callumbwhyte"
        }
      ]
    }
  ],
  "room": "Salon G",
  "track": "DevOps",
  "tags": [
    ".NET",
    "Cloud",
    "DevOps"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Thursday",
  "startTime": "15:30",
  "endTime": "16:30",
  "excerpt": "You've made it big time, and your web app just can't handle the traffic... Where do you even start with scaling in Azure?\n\nThis session will cover all there is to know about efficiently scaling an app on Azure; from scaling on App Service, to hosting in containers on AKS, and all the DevOps magic in...",
  "description": "You've made it big time, and your web app just can't handle the traffic... Where do you even start with scaling in Azure?\n\nThis session will cover all there is to know about efficiently scaling an app on Azure; from scaling on App Service, to hosting in containers on AKS, and all the DevOps magic in between.\n\nLets start by exploring the auto-scaling options available in Azure App Service, using Application Insights to guide the thresholds we set and monitor how our app performs. We'll see the impact that external dependencies (database, storage) has on scaling, and smart ways to mitigate any challenges that arise.\n\nAs our scale grows, so will our costs... We'll share our tips for cost effective scaling, taking a look at the options Azure makes available at our fingertips – through containerized apps + AKS, and serverless products like Azure SQL Serverless.\n\nFinally, we'll show how to configure a deployment pipeline in Azure DevOps that glues all of these solutions together."
}