{
  "id": "534777",
  "title": "Building Trust and Breaking Barriers (with LEGO!)",
  "speakers": [
    {
      "id": "da1f3c6b-ce55-48df-824c-c6f681f77f8c",
      "name": "Thomas Haver",
      "photo": "https://sessionize.com/image/14f1-400o400o1-6b-ce55-48df-824c-c6f681f77f8c.9e79a9ba-4763-4404-a3db-cccd558f6a08.jpg",
      "bio": "\n Thomas is presently serving as a Test Automation Architect. He leads a team of testers, ops engineers, and production support analysts in the adoption of DevOps practices. Previously, he led the enterprise automation support of 73 applications at Huntington National Bank that encompassed testing, metrics &amp; reporting, and data management. Thomas has a background in Physics &amp; Biophysics, with over a decade spent in research science studying fluorescence spectroscopy and microscopy before joining IT.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/cogsfun"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/thomas-haver/"
        },
        {
          "title": "Blog",
          "url": "https://red-green-refactor.com/"
        },
        {
          "title": "Company Website",
          "url": "https://www3.mtb.com/"
        }
      ]
    }
  ],
  "room": "Salon E",
  "track": "Teams & Collaboration",
  "tags": [
    "Leadership",
    "Project Management",
    "QA Testing"
  ],
  "format": "PreCompiler",
  "level": "Introductory and overview",
  "day": "Tuesday",
  "startTime": "8:00",
  "endTime": "12:00",
  "excerpt": "LEGO(R) sets are fun to build, but who has ever attempted to build a set without looking at the instructions? In this workshop, attendees will form teams and attempt to build a LEGO(R) set without instructions. Through a series of iterative exercises that provide more product details, the teams will...",
  "description": "LEGO(R) sets are fun to build, but who has ever attempted to build a set without looking at the instructions? In this workshop, attendees will form teams and attempt to build a LEGO(R) set without instructions. Through a series of iterative exercises that provide more product details, the teams will attempt to build &amp; test their product as close to the instructions as possible without peeking.\n\nEach group will learn different approaches to collaborate on product development and testing during the meeting to build a set according to a customer's needs. The workshop will highlight the gap between what we set out to build &amp; the finished product as well as the gap between what our customers expect &amp; the finished product. Our goal as a group will be to refine our techniques so we deliver a product on-time &amp; on-budget that customers will love."
}