{
  "id": "534776",
  "title": "[KidzMash] Become a LEGO Master Builder With Teamwork!",
  "speakers": [
    {
      "id": "da1f3c6b-ce55-48df-824c-c6f681f77f8c",
      "name": "Thomas Haver",
      "photo": "https://sessionize.com/image/14f1-400o400o1-6b-ce55-48df-824c-c6f681f77f8c.9e79a9ba-4763-4404-a3db-cccd558f6a08.jpg",
      "bio": "\n Thomas is presently serving as a Test Automation Architect. He leads a team of testers, ops engineers, and production support analysts in the adoption of DevOps practices. Previously, he led the enterprise automation support of 73 applications at Huntington National Bank that encompassed testing, metrics &amp; reporting, and data management. Thomas has a background in Physics &amp; Biophysics, with over a decade spent in research science studying fluorescence spectroscopy and microscopy before joining IT.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/cogsfun"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/thomas-haver/"
        },
        {
          "title": "Blog",
          "url": "https://red-green-refactor.com/"
        },
        {
          "title": "Company Website",
          "url": "https://www3.mtb.com/"
        }
      ]
    }
  ],
  "room": "Guava / Tamarind",
  "track": "KidzMash",
  "tags": [
    "Career Development",
    "Soft Skills",
    "Leadership"
  ],
  "format": "KidzMash Sessionz",
  "level": "",
  "day": "Friday",
  "startTime": "9:00",
  "endTime": "10:00",
  "excerpt": "LEGO(R) sets are amazingly fun to build, but who has attempted to build a complete set without looking at the instructions? In this session, the kidz & adults will form teams and try to build one of sixteen different Creator sets without the instructions. Only one person from each team will be able...",
  "description": "LEGO(R) sets are amazingly fun to build, but who has attempted to build a complete set without looking at the instructions? In this session, the kidz &amp; adults will form teams and try to build one of sixteen different Creator sets without the instructions. Only one person from each team will be able to see the finished picture before the team starts building. That person must share their vision with the team, who will attempt to build the LEGO(R) set as close to the instructions as possible without peeking. The groups will learn different ways to collaborate during the session to build the most accurate Creator LEGO(R) set."
}