{
  "id": "534992",
  "title": "Morality and AI: How do I use this power responsibly?",
  "speakers": [
    {
      "id": "2e4f0878-3e9b-4f24-aa95-50dac254c1b7",
      "name": "Cameron Vetter",
      "photo": "https://sessionize.com/image/7096-400o400o1-MpmevFyQAXYAzicU6mxQT3.jpg",
      "bio": "Cameron Vetter is a technologist with 25 years of experience using Microsoft tools and technologies to create products. He has experience in Technical, Leadership, and Managerial roles in many different organizations.\n \n Cameron has worked for some of the largest companies in the world as well as small companies getting a breadth of experience helping him understand the needs of different size businesses and different verticals. He is the Principal Architect at the Octavian Technology Group, where he helps clients develop technical strategies and execute them. He helps clients Architect, Design, and Develop software focusing on Deep Learning, Artificial Intelligence, Cloud Architecture, Mixed Reality, and Azure.\n \n Cameron enjoys sharing what he has learned by speaking at national, regional, and local conferences, including THAT Conference, Microsoft Ignite, The Midwest Architect Community Conference, AI DevWorld, and various technology user groups. \n \n In 2019, he was named a Microsoft MVP for Artificial Intelligence (AI) – one of the first honorees in the U.S. and has received an MVP award for 5 consecutive years.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/poshporcupine"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/cameronvetter/"
        },
        {
          "title": "Company Website",
          "url": "http://www.octaviantg.com"
        }
      ]
    }
  ],
  "room": "Orange",
  "track": "Data",
  "tags": [
    "Machine Learning",
    "Data Science"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Friday",
  "startTime": "14:45",
  "endTime": "15:45",
  "excerpt": "As artificial intelligence (AI) continues to advance, it becomes increasingly important to address the ethical implications and moral considerations surrounding its use. In this talk, we will explore the intersection of morality and AI, focusing on how individuals and organizations can wield this...",
  "description": "As artificial intelligence (AI) continues to advance, it becomes increasingly important to address the ethical implications and moral considerations surrounding its use. In this talk, we will explore the intersection of morality and AI, focusing on how individuals and organizations can wield this power responsibly.\n\nAI, including language models like GPT-3 and GPT-4, possesses immense potential to shape our society and influence decision-making processes. However, with great power comes great responsibility. We will delve into the ethical challenges and moral dilemmas that arise when utilizing AI, particularly in the context of language models.\n\nJoin us as we discuss the principles and frameworks that can guide responsible AI usage. We will explore topics such as fairness, transparency, accountability, and privacy. By understanding these principles, individuals and organizations can ensure that their AI applications align with ethical standards and societal values.\n\nFurthermore, we will examine the importance of diverse and inclusive data in training AI models. We will address the risks of bias and discrimination and discuss strategies to mitigate these issues, promoting fairness and equity in AI systems.\n\nThrough real-world case studies and examples, we will highlight the potential consequences of irresponsible AI use and the importance of proactive ethical considerations.\n\nJoin us in this talk to gain a deeper understanding of the moral dimensions of AI and how to navigate them responsibly. Discover how to leverage AI, including language models, in a manner that aligns with ethical principles and contributes positively to society. Together, let's harness the power of AI while upholding our moral obligations."
}