{
  "id": "535120",
  "title": "Binary Analysis - Learn to break stuff",
  "speakers": [
    {
      "id": "68accf5c-4f6c-406f-806a-38f0527793b5",
      "name": "Jason Slagle",
      "photo": "https://sessionize.com/image/a27e-400o400o1-nnxs8YgCzFAHKCCEE1x9Pv.jpeg",
      "bio": "Jason Slagle is a 25 year veteran of Systems and Network administration.  Having worked on everything from Linux systems to Cisco networks and SAN Storage, he is always looking for ways to make his work repeatable and automated. \n \n Jason has two boys - Ben 4 and Jacob 7.  When not being kept busy in other fashions he serves as a Scout leader for Cub scouts in Jacob's pack.\n \n When not otherwise occupied by his family or hacking at a computer for work or pleasure, he enjoys running, cycling, and occasionally geocaching.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/jslagle"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/jslagle/"
        }
      ]
    },
    {
      "id": "ee7a2db7-b2ba-45f8-b0f3-09c76620235b",
      "name": "John Hammond",
      "photo": "https://sessionize.com/image/0ca6-400o400o1-398298f9-1e45-4d0c-8d7d-04b9907db32d.jpg",
      "bio": "John Hammond is a cybersecurity researcher, educator and content creator. As part of the Research &amp; Development Threat Operations team at Huntress, John spends his days analyzing malware and making hackers earn their access. Previously, as a Department of Defense Cyber Training Academy instructor, he taught the Cyber Threat Emulation course, educating both civilian and military members on offensive Python, PowerShell, other scripting languages and the adversarial mindset. He has developed training material and information security challenges for events such as PicoCTF and competitions at DEFCON US. John speaks at security conferences such as BsidesNoVA, to students at colleges such as the US Naval Academy, and other online events including the SANS Holiday Hack Challenge/KringleCon. He is an online YouTube personality showcasing programming tutorials, CTF video walkthroughs and other cyber security content.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/_johnhammond"
        },
        {
          "title": "LinkedIn",
          "url": "https://linkedin.com/in/johnhammond010"
        },
        {
          "title": "Blog",
          "url": "https://johnhammond.llc"
        }
      ]
    }
  ],
  "room": "Cypress",
  "track": "Security",
  "tags": [
    "Hardware",
    "Security"
  ],
  "format": "PreCompiler",
  "level": "Intermediate",
  "day": "Tuesday",
  "startTime": "13:00",
  "endTime": "17:00",
  "excerpt": "In this Pre-Compiler, we'll take a dive into the world of reverse engineering. \n\nWe'll start with DotPeek and reverse engineer a handful of binaries, starting with simple and ending with somewhat more complex examples with some obfuscation.  We'll also discuss problems in these tools and techniques...",
  "description": "In this Pre-Compiler, we'll take a dive into the world of reverse engineering.\n\nWe'll start with DotPeek and reverse engineer a handful of binaries, starting with simple and ending with somewhat more complex examples with some obfuscation.  We'll also discuss problems in these tools and techniques malware authors use to avoid analysis.\n\nAfterward, we'll really get our feet wet with Ghidra.  We'll look into reversing some C binaries, C++, and Go.\n\nIf time allows, we'll look into more complicated examples of malware analysis and level up skills all around.\n\nSome knowledge of C# and x86 assembly is helpful but not required!  Come out for a half day of reverse engineering fun!"
}