{
  "id": "535249",
  "title": "Black Box Techniques for Unit Tests",
  "speakers": [
    {
      "id": "97b29c15-84f0-4899-97b8-57ed6d8e390b",
      "name": "Jenny Bramble",
      "photo": "https://sessionize.com/image/576d-400o400o1-15-84f0-4899-97b8-57ed6d8e390b.e85515ac-20f9-4a6b-9300-618d148919ac.jpg",
      "bio": "Jenny ended up in a quality assurance career after coming up through support and devops, cutting her teeth on that interesting role that acts as the 'translator' between customer requests from support and the development team.  Her love of support and the human side of problems lets her find a sweet spot between empathy for the user and empathy for my team.  She's done testing, support, or human interfacing for most of her career.  She finds herself happiest when she's making an impact on other people--whether it's helping find issues in applications, leading scrum, speaking at events, or just grabbing coffee and chatting. \n \n Twitter: @jennydoesthings",
      "links": [
        {
          "title": "Twitter",
          "url": "http://twitter.com/jennydoesthings"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/jennybramble"
        },
        {
          "title": "Blog",
          "url": "http://jennydoesthings.com"
        }
      ]
    }
  ],
  "room": "Salon H",
  "track": "Software Quality",
  "tags": [
    "Programming Principles",
    "Code Quality",
    "QA Testing"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Thursday",
  "startTime": "9:15",
  "endTime": "10:15",
  "excerpt": "One of the greatest strengths of modern development is the ease of unit testing for many languages and frameworks. Obviously, you’re testing your code–but are you thoroughly testing it? Are you testing the right things? Is there more you could be testing?\n\nEnter black box testing techniques....",
  "description": "One of the greatest strengths of modern development is the ease of unit testing for many languages and frameworks. Obviously, you’re testing your code–but are you thoroughly testing it? Are you testing the right things? Is there more you could be testing?\n\nEnter black box testing techniques. Equivalence partitioning. Boundary value analysis. Decision tables. Combinatorial testing. State transition testing. While black box is done without considering the code, these are the foundational testing techniques and can be applied to any type of testing. You’ll learn about each type of testing and how to apply it to different situations to understand the features better and engage in deeper testing.\n\nJoin me as we walk through these five foundational techniques and how we can apply them to our unit tests. You’ll come away from the talk with a stronger understanding of testing and how to go beyond ‘Does it work’ into ‘Does it work well?’"
}