{
  "id": "535246",
  "title": "Creative Problem Solving",
  "speakers": [
    {
      "id": "f46fcf13-76db-4850-9995-ac8d076ba1de",
      "name": "Eric Potter",
      "photo": "https://sessionize.com/image/cc5e-400o400o1-RHPaZf2AMz7uxXzeTKj3G.jpg",
      "bio": "Eric is the Director of Technical Education for Sweetwater and a Microsoft MVP for Visual Studio and Development Technologies. He works primarily in the .Net web platform but loves opportunities to try out other stacks. He has been developing high-quality custom software solutions since 2001. He has successfully delivered solutions for clients in a wide variety of industries. He loves to dabble in new and exciting technologies. In his spare time, he loves to tinker with Arduino projects. He fondly remembers what it was like to develop software for the Palm OS. He has an amazing wife and 5 wonderful children. He blogs at http://humbletoolsmith.com/ and you can follow him on Twitter as @pottereric. \n",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/pottereric"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/ericbpotter/"
        },
        {
          "title": "Blog",
          "url": "http://humbletoolsmith.com/"
        },
        {
          "title": "Company Website",
          "url": "https://humbletoolsmith.com"
        }
      ]
    }
  ],
  "room": "Indigo Bay",
  "track": "Teams & Collaboration",
  "tags": [
    "Career Development",
    "Soft Skills",
    "Leadership",
    "Teams"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Thursday",
  "startTime": "13:00",
  "endTime": "14:00",
  "excerpt": "You're a developer. Solving problems is a big part of what you do. But how can you learn to think more clearly and more creatively about the problems you are solving? In this session, you will learn about the cognitive science of creative thinking. You will also learn some practical things you can...",
  "description": "You're a developer. Solving problems is a big part of what you do. But how can you learn to think more clearly and more creatively about the problems you are solving? In this session, you will learn about the cognitive science of creative thinking. You will also learn some practical things you can do to solve problems individually or as a team."
}