{
  "id": "535254",
  "title": "Building Better Teams Through Play",
  "speakers": [
    {
      "id": "97b29c15-84f0-4899-97b8-57ed6d8e390b",
      "name": "Jenny Bramble",
      "photo": "https://sessionize.com/image/576d-400o400o1-15-84f0-4899-97b8-57ed6d8e390b.e85515ac-20f9-4a6b-9300-618d148919ac.jpg",
      "bio": "Jenny ended up in a quality assurance career after coming up through support and devops, cutting her teeth on that interesting role that acts as the 'translator' between customer requests from support and the development team.  Her love of support and the human side of problems lets her find a sweet spot between empathy for the user and empathy for my team.  She's done testing, support, or human interfacing for most of her career.  She finds herself happiest when she's making an impact on other people--whether it's helping find issues in applications, leading scrum, speaking at events, or just grabbing coffee and chatting. \n \n Twitter: @jennydoesthings",
      "links": [
        {
          "title": "Twitter",
          "url": "http://twitter.com/jennydoesthings"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/jennybramble"
        },
        {
          "title": "Blog",
          "url": "http://jennydoesthings.com"
        }
      ]
    }
  ],
  "room": "Salon B",
  "track": "Teams & Collaboration",
  "tags": [
    "Soft Skills",
    "Leadership"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Friday",
  "startTime": "14:45",
  "endTime": "15:45",
  "excerpt": "Teams work incredibly hard to drive software and processes forward. Sometimes we neglect the emotional side of our hard work, leaving teams brittle and less able to adapt and bend. How do we release tension and form the strong bonds that a good team needs to be successful as well as honing some of...",
  "description": "Teams work incredibly hard to drive software and processes forward. Sometimes we neglect the emotional side of our hard work, leaving teams brittle and less able to adapt and bend. How do we release tension and form the strong bonds that a good team needs to be successful as well as honing some of our hard won skills?\n\nAs children, we form strong bonds during recess or at play dates. As adults, we lose this sense of companionship and playfulness. Bring it back to your team with targeted fun activities that create a sense of mindfulness, improve skills, and are just downright enjoyable. Team building is the most difficult aspect of leadership–peer or otherwise. One of the best ways to facilitate team building is play!\n\nI will present a method for skills and team building outside of the norm in play time. I will show how events can be arranged, when to do them, and what the benefits are for play time–including stronger teams that work better together due to their powerful relationships between team members.\n\nWe will also discuss different games such as TestSphere Arena, TestSphere Bingo, “Murder” Mystery, Quality Jenga, The Planning Game, Telephone, and more! She will tie each of these games back to an element of your job."
}