{
  "id": "535306",
  "title": ".NET on AWS: Wait, you can do that?",
  "speakers": [
    {
      "id": "07321b09-c739-442c-863c-823b8ede21f0",
      "name": "Brad Knowles",
      "photo": "https://sessionize.com/image/191f-400o400o1-JaoxZgUAvcAy2CrRjwfiuN.jpg",
      "bio": "Brad is a Cloud Application Architect for AWS Professional Services, specializing in helping customers migrate and optimize their .NET workloads for the cloud. Having worked with .NET since version 2.0, Brad has witnessed the evolution of the framework from when running apps in IIS on Windows were all the rage to the latest hotness of orchestrating containerized Linux instances in the cloud. A frequent user of the phrase \"It depends.\", Brad uses his knowledge and expertise to develop scalable solutions while reducing unwarranted complexity.\n \n Brad lives in Columbus, OH with his wife and plays backup hooman to a very handsome, yet misguided, cat who thinks he's in charge.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/Brad_Knowles"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/bradknowles/"
        },
        {
          "title": "Blog",
          "url": "https://bradknowles.com/"
        }
      ]
    }
  ],
  "room": "Salon A",
  "track": "Architecture",
  "tags": [
    ".NET",
    "C#",
    "Cloud"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Friday",
  "startTime": "12:15",
  "endTime": "13:15",
  "excerpt": ".NET on AWS: Wait, you can do that?\n\nThat's right, .NET is a first-class citizen on AWS, meaning you can run any .NET workload in your organization. Are you currently using AWS and need help understanding the .NET landscape?  Are you comparing cloud providers and looking to understand what AWS can...",
  "description": ".NET on AWS: Wait, you can do that?\n\nThat's right, .NET is a first-class citizen on AWS, meaning you can run any .NET workload in your organization. Are you currently using AWS and need help understanding the .NET landscape?  Are you comparing cloud providers and looking to understand what AWS can offer? Whether it’s an older .NET Framework 3.5 web app or the newest .NET 8 microservice, AWS has a service that can run it.\n\nYou'll see demonstrations such as:\n\n* .NET apps running in EC2 virtual machines\n* ElasticBeanstalk hosting an IIS website\n* Lambda functions written in C#\n* .NET container workloads in Elastic Container Service\n\nYou'll even see how to use C# to provision the necessary infrastructure! You'll leave this session ready to run your .NET code in AWS first thing on Monday."
}