{
  "id": "535352",
  "title": "Bad Tendencies in Leaders and How to Manage Up",
  "speakers": [
    {
      "id": "ec1853a0-0ae7-4581-b752-37942eb1928b",
      "name": "Benjamin Dobrowolski",
      "photo": "https://sessionize.com/image/a644-400o400o1-LKiQE8HwCf2WfaLiiVqiZ1.PNG",
      "bio": "From cold calling to project management; car dealerships to welding joints; small companies and large companies, I’ve done a little bit of everything. Right now, I enable teams to deliver high quality software at CGI as a Project Manager and enjoy the challenge. When I’m not working, I’m giving baseball lessons, watching the Cincinnati Reds, or doing something outside. My beautiful wife also makes me try new things sometimes.",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/dobrowolskib"
        },
        {
          "title": "Blog",
          "url": "https://www.linkedin.com/in/dobrowolskib/"
        },
        {
          "title": "Company Website",
          "url": "https://www.cgi.com"
        }
      ]
    }
  ],
  "room": "Cypress",
  "track": "Teams & Collaboration",
  "tags": [
    "Soft Skills",
    "Leadership",
    "Project Management"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Thursday",
  "startTime": "15:30",
  "endTime": "16:30",
  "excerpt": "No matter where you’ve worked, we’ve all had those bosses that we’ve not gotten along with. \n\nBut what if you did more than complain about it? What if you could “manage” your boss, to not only your benefit, but to your co-workers benefit as well? \n\nTake back control and learn to manage up...",
  "description": "No matter where you’ve worked, we’ve all had those bosses that we’ve not gotten along with.\n\nBut what if you did more than complain about it? What if you could “manage” your boss, to not only your benefit, but to your co-workers benefit as well?\n\nTake back control and learn to manage up so that you can work with all types of people and succeed no matter the environment.\n\nIn this talk, we cover the common archetypes of “bad leaders”, why they operate this way, and practical methods to work with difficult leaders so that you can keep the work moving and your sanity intact.\n\nThere’s no miracle cures here, but you’d be surprised on what’s possible.\n\nTarget Audience: Contributors who deal with frustrating leaders, and for leaders themselves who are willing to be self-reflective.\n"
}