{
  "id": "535629",
  "title": "Beyond the Cache with Redis + Node.js",
  "speakers": [
    {
      "id": "1b601568-9ef8-4a2b-9599-c67f6c1abe18",
      "name": "Justin Castilla",
      "photo": "https://sessionize.com/image/ed0a-400o400o1-Lc8B8QyPs5PschfyLzRaiu.png",
      "bio": "Justin started his Software Engineering career as a Web Development Boot Camp Instructor where he developed a passion for exciting others with new concepts and empowering individuals with the tools needed to excel in their own right. As a Developer Advocate at Redis, Justin has created numerous videos breaking down Data Structures into easy-to-understand, relatable examples with real-world use cases. \n \n In his spare time, Justin enjoys hiking around the Pacific Northwest, building hobby electronics, and collecting vintage music synthesizers. His love of hardware and software has led him into a deep exploration of IoT for practical applications as well as performance art!",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/justincastilla/"
        },
        {
          "title": "Blog",
          "url": "https://www.youtube.com/watch?v=Tqaqdfxi-J4&list=PL83Wfqi-zYZG_tk7VQvkPDqRua0uwfXIF&ab_channel=Redis"
        },
        {
          "title": "Company Website",
          "url": "https://www.redis.com"
        }
      ]
    }
  ],
  "room": "Salon E",
  "track": "Data",
  "tags": [
    "Javascript",
    "Databases"
  ],
  "format": "PreCompiler",
  "level": "Introductory and overview",
  "day": "Wednesday",
  "startTime": "13:00",
  "endTime": "17:00",
  "excerpt": "If you’re like a lot of developers, you’ve probably used Redis. You’ve probably used it as a cache—which it does amazingly—and you’ve probably cached strings. But Redis is much, much more than just a cache. It can be a message broker using queues, streams, and pub-sub. It can be a...",
  "description": "If you’re like a lot of developers, you’ve probably used Redis. You’ve probably used it as a cache—which it does amazingly—and you’ve probably cached strings. But Redis is much, much more than just a cache. It can be a message broker using queues, streams, and pub-sub. It can be a multi-model, in-memory, NoSQL database storing all sorts of data structures like hashes, lists, sets, and binary data. It can even be extended using modules to add new commands, new data structures, and new capabilities.\n\nIn this workshop, I’ll show you how to take full advantage of all that Redis can do from your Node.js applications—starting from the very beginning with a primer on Redis. We’ll cover the basics—talking to Redis from the command line and exploring its capabilities. Then, we’ll take advantage of those capabilities from Node.js, building some simple yet surprising powerful applications using the low-level Node.js client—Node Redis.\n\nAfter that, we’ll look at ways to extend Redis with modules, with an emphasis on using RediSearch to find the data and RedisJSON to store documents.\n\nRedis does a lot more than you probably thought. The whole point of this workshop is to show you that “more” and give you the knowledge to take greater advantage of the Redis you are already using. So, let’s start learning and start using!"
}