{
  "id": "535707",
  "title": "How to answer \"When will it be done?\" using probabilistic forecasting.",
  "speakers": [
    {
      "id": "fc1414a2-d5df-45eb-a956-cc06cd039567",
      "name": "Chris Shinkle",
      "photo": "https://sessionize.com/image/995d-400o400o1-43S661ybbuw6wqmodTJ92n.png",
      "bio": "Chris Shinkle is a practitioner and maker. He is a thought leader and continually initiates new ideas and continuous improvement at SEP. His experience comes from building products with many large clients in a variety of industries: aerospace, medical, healthcare, finance, etc. He introduced and guided SEPʼs adoption of Agile software development practices in 2004 followed by Lean and Kanban in 2007. As SEPʼs Director of Innovation, Chris leverages many community ideas helping SEP engineers and clients delivery better products. Chris speaks at conferences across the United States promoting Agile, Lean/Kanban, Product Management, and Design Thinking. Chris was an inaugural members of Indiana’s Techpoint Tech 25.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/chrisshinkle"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/chrisshinkle/"
        },
        {
          "title": "Company Website",
          "url": "http://www.sep.com"
        }
      ]
    }
  ],
  "room": "Cypress",
  "track": "Teams & Collaboration",
  "tags": [
    "Agile",
    "Project Management",
    "Velocity"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Friday",
  "startTime": "9:45",
  "endTime": "10:45",
  "excerpt": "\"When will it be done?\" How often have you been asked that question? That question strikes fear or frustration in most people. It often results in throwing up your hands in frustration or tossing out a wild guess. Surely there's a better way?\n\nForget story points, t-shirt sizing, historical...",
  "description": "\"When will it be done?\" How often have you been asked that question? That question strikes fear or frustration in most people. It often results in throwing up your hands in frustration or tossing out a wild guess. Surely there's a better way?\n\nForget story points, t-shirt sizing, historical averages. Have you considered building a simple forecasting model—one that provides a range of possible outcomes with confidence levels?\n\nWhether you're a developer, project manager, or scrum master, it's important we can answer this question confidently in a way that provides clarity and predictability.  We can do that by applying techniques like Monte Carlo simulation and continuous forecasting.&nbsp;\n\nIn this talk, we'll explore those practices and discuss how you can leverage them no matter your role.  I'll share a few models and spreadsheets we use with our clients including examples.  We'll walk through how to use these to support better communication and consider what-if scenarios.  You'll leave with a practical set of tools you can start using tomorrow!&nbsp;\n\nAnswering the question \"When will it be done?\" will no longer create frustration or fear like it once did."
}