{
  "id": "536138",
  "title": "Networking for Introverts: Build, Maintain, and Use Networks Without Being Creepy",
  "speakers": [
    {
      "id": "c06cdefb-0d76-4a49-83f1-2afb808203ac",
      "name": "Brian MacDonald",
      "photo": "https://sessionize.com/image/161e-400o400o1-fb-0d76-4a49-83f1-2afb808203ac.f1951562-f78f-4f89-9d8a-a4bf67f58f3c.jpg",
      "bio": "Brian MacDonald has been an editor of technical publications for over 20 years. For most of that time, he ran his own business, with clients including O’Reilly, Pragmatic Bookshelf, Wiley, Apress, Wrox, Osborne, and Manning. He also spent a few years as a technical writer at Microsoft. He has co-authored two editions of Learning C# and Learning ASP.NET for O’Reilly. He lives in southeastern Pennsylvania with his wife and son. You can follow him on Twitter at @bmac_editor.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/bmac_editor"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/macdonaldeditorial/"
        }
      ]
    }
  ],
  "room": "Cypress",
  "track": "Career Development",
  "tags": [
    "Career Development",
    "Diversity/Equity/Inclusion",
    "Soft Skills"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Friday",
  "startTime": "11:00",
  "endTime": "12:00",
  "excerpt": "You've heard that having a professional network is important for career growth, for learning about your industry, and to help out in the event of a layoff. But how do you go about building one from scratch? Taking a transactional, goal-oriented approach may be good engineering design, but it tends...",
  "description": "You've heard that having a professional network is important for career growth, for learning about your industry, and to help out in the event of a layoff. But how do you go about building one from scratch? Taking a transactional, goal-oriented approach may be good engineering design, but it tends to fall apart when your network is made of humans with squishy feelings.\nIn this session, you'll learn how to engage with people, even when it's scary. You'll discover the value of community beyond short-term results. You'll get advice on altruistic participation, and see why that works in the long run. And you'll find out how to ask for help appropriately when you need it.\nAttendees will learn:\n* What a network is for, and what it isn't for\n* How to break the transactional mindset around networking\n* How to make new connections for yourself and others\n* How to contribute to a community before asking favors of it\n* How to engage your network when you need help"
}