{
  "id": "536266",
  "title": "Building accessible Android apps using Jetpack Compose",
  "speakers": [
    {
      "id": "415d5e32-f09f-43de-862c-087e586433ab",
      "name": "Devanshu Chandra",
      "photo": "https://sessionize.com/image/614a-400o400o1-USKU8bZ9yL98qFEGEFZtX6.png",
      "bio": "Devanshu has been an Android Developer since 2016 and with Deque since 2020. He takes a keen interest in teaching Android mobile accessibility to a new generation of developers across the globe.\n",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/chandradevanshu"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/devanshu-chandra-84747441"
        },
        {
          "title": "Blog",
          "url": "https://www.deque.com/blog/author/devanshu-chandradeque-com/"
        },
        {
          "title": "Company Website",
          "url": "https://www.deque.com/"
        }
      ]
    }
  ],
  "room": "Salon B",
  "track": "Mobile",
  "tags": [
    "Mobile"
  ],
  "format": "General Session",
  "level": "Advanced",
  "day": "Thursday",
  "startTime": "16:45",
  "endTime": "17:45",
  "excerpt": "Recently Android introduced a new technique of developing Android user interface called Jetpack Compose. Using Kotlin APIs Jetpack Compose provides a faster and easier way to develop Android UI and has inbuilt support for Material Design, Dark Theme, Animation and much more. In this session we will...",
  "description": "Recently Android introduced a new technique of developing Android user interface called Jetpack Compose. Using Kotlin APIs Jetpack Compose provides a faster and easier way to develop Android UI and has inbuilt support for Material Design, Dark Theme, Animation and much more. In this session we will be talking about\nHow Android’s Accessibility Service handles composables.\nHow to make Android Applications written in Jetpack Compose accessible using simple techniques and APIs.\nHow to create Custom Accessibility Actions for complex user interfaces.\nWhen and when not to use Custom Accessibility actions.\nWe will be looking at certain examples of composables like Switch, Button, Text Input, Checkbox, etc. and try to understand what makes them accessible and what can make them inaccessible."
}