{
  "id": "536424",
  "title": "The Five Code Reviewers You Meet At Work",
  "speakers": [
    {
      "id": "8500e686-5de3-45f4-b167-7e5129f39b01",
      "name": "Aaron Salvo",
      "photo": "https://sessionize.com/image/5c9b-400o400o1-SMMPavyzwURS3auCWruNBA.jpeg",
      "bio": "Aaron has over 20 years of experience coding and engineering system. \n \n They are currently using their talents at Callibrity Solutions to help their clients streamline their processes. \n \n They are polyglot coder who loves programming languages. They have written production code in Python, Perl, Java, VB.Net, and can write “Hello, World” in a bunch more. \n \n Aaron has also worked as a pastry chef in Atlanta and Cleveland, and has a deep love and appreciation for art and delighting people. \n \n This experience has given Aaron a unique perspective on the role of technology as a force for improving people’s lives.",
      "links": []
    }
  ],
  "room": "Nile",
  "track": "Software Quality",
  "tags": [
    "Career Development",
    "Soft Skills",
    "Code Quality"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Friday",
  "startTime": "14:45",
  "endTime": "15:45",
  "excerpt": "When you review code at work do you simply trust your peers have written bug-free code? Does a co-worker infuriate you when they block your pull request over indention? Are you a freshman engineer who worries they'll get an atomic wedgie by the coffee maker if you point out a syntax error in a...",
  "description": "When you review code at work do you simply trust your peers have written bug-free code? Does a co-worker infuriate you when they block your pull request over indention? Are you a freshman engineer who worries they'll get an atomic wedgie by the coffee maker if you point out a syntax error in a principal engineer’s code?\n\nThis session will help to identify which of the Five Archetypes fits your style, and how that should inform the reviews you give.\n\nCome review the reviewers and gain an understanding of the strengths &amp; weaknesses of each style, how each style benefits your project, how to avoid the pitfalls of your personal style, and how to overcome our unconscious (and sometimes conscious) biases to empower even the most junior member of your team to provide high-quality code reviews."
}