{
  "id": "536733",
  "title": "Dream Teams:  Hiring (and Keeping) the Right People",
  "speakers": [
    {
      "id": "0a6a65cd-0f7c-4490-8168-3ac1d1f0c869",
      "name": "Michelle Smith",
      "photo": "https://sessionize.com/image/dae0-400o400o1-VZ3TL5yxvcZKJqjVZ2yHyP.jpg",
      "bio": "Dr. Michelle Smith’s unusual background gives her a fresh perspective on the tech industry and what it takes to build and keep great teams.  She is a veterinarian by education, and she still practices in the State of Ohio.  She’s also been an executive at a global software company and an active leader in her local community.  But her real passions are entrepreneurship and building successful organizations.  Along with her husband and business partner, Steve Smith, Michelle has built and sold several technology companies.  Michelle and her current team (which include several alumni from previous companies!) work with organizations to help them not only improve the quality of their code, but their overall teamwork.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/mickeyme"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/michellesmith6/"
        }
      ]
    }
  ],
  "room": "Salon H",
  "track": "Teams & Collaboration",
  "tags": [
    "Soft Skills",
    "Leadership",
    "Teams"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Friday",
  "startTime": "12:15",
  "endTime": "13:15",
  "excerpt": "Everyone says that “your people are your most important asset.” But how do you find the RIGHT people?  And once you have them, how do you keep them?  In this entertaining session, we’ll turn the traditional hiring process on its head and share a new perspective on how to identify the right...",
  "description": "Everyone says that “your people are your most important asset.” But how do you find the RIGHT people?  And once you have them, how do you keep them?  In this entertaining session, we’ll turn the traditional hiring process on its head and share a new perspective on how to identify the right people for YOUR organization.  You’ll also learn important lessons on what really matters to your employees (spoiler – it’s probably not what you think) and how to keep people engaged for the long term.  Hiring managers are encouraged to attend, but anyone who works on a team will find practical tips on how to work successfully with other human beings.  Whether you work on a remote team or are trying to fill up empty desks in your office, you CAN create your own dream team!"
}