{
  "id": "537174",
  "title": "Scrambled - Solving a Rubik's cube!",
  "speakers": [
    {
      "id": "4b971f2e-b892-4949-b543-832e2f4dc5df",
      "name": "Yajat Nahata",
      "photo": "https://sessionize.com/image/7af4-400o400o1-9iJt1LDVgWGo39FJtySQrs.png",
      "bio": "Primary Speaker - Yajat Nahata\n ----------------------------------------------\n \n Yajat is a 6th grader who likes to play video games such as Minecraft, Among Us, Roblox and collect Pokemon cards. When he turned 9, he was introduced to the world of Rubik's cube by his friend. \n \n Fascinated by the challenge, he spent countless hours in learning how to solve a Rubik's cube. Eventually he develop his cubing skills to solve a variety of cubes such as Axis cube and Megaminx. He is continuously refining his technique to solve them faster and tackling new cubes like perplexus cube. \n \n At school, he enjoys math and playing soccer. He is dabbling in HTML to build a game with his friends.\n \n Secondary Speaker - Umang Nahata\n ----------------------------------------------------\n Umang is a Senior test engineer with Progressive Insurance and has more than a decade of developer-tester experience under his wings. Being curious and lazy, he's on the lookout for new approaches, ideas and ways to make his work/life better. He is passionate about his own development and in sharing his learning with others.\n \n When not working or tinkering with tech, he loves to spend his time with his family…",
      "links": []
    }
  ],
  "room": "Portia / Wisteria",
  "track": "KidzMash",
  "tags": [
    "Soft Skills"
  ],
  "format": "KidzMash Divez",
  "level": "",
  "day": "Friday",
  "startTime": "9:30",
  "endTime": "11:30",
  "excerpt": "Have you ever wondered why solving a Rubik's cube is so much fun yet challenging! In this session, I will share how I solve a 3x3x3 Rubik's cube using the beginner's method and making it fun and exciting.\n\nWe will cover the history of the Rubik's cube and then move onto the basics such as the sides,...",
  "description": "Have you ever wondered why solving a Rubik's cube is so much fun yet challenging! In this session, I will share how I solve a 3x3x3 Rubik's cube using the beginner's method and making it fun and exciting.\n\nWe will cover the history of the Rubik's cube and then move onto the basics such as the sides, colors, and layers. We will talk about different scenarios and algorithms.\n\nIf time permits, we will take a look at other cubes such as pyraminx, 4x4, and more. Hopefully, at the end of this session, you can add solving a Rubik's cube to your talents!\n\nBring our own Rubik's cube to this session. If you don't have one, we will provide you with one. Just bring your zest to unscramble a cube and we'll handle the rest!\n"
}