{
  "id": "537293",
  "title": "Deliver what the client wants instead of what they ask for! Getting them to tell you what they need.",
  "speakers": [
    {
      "id": "3c774b73-d976-4916-ac8a-fac04a4bc9ca",
      "name": "Angel Thomas",
      "photo": "https://sessionize.com/image/78e0-400o400o1-73-d976-4916-ac8a-fac04a4bc9ca.80df98f4-7735-4bab-bd1f-8bb3d3da8c35.png",
      "bio": "Angel is a software engineer contractor at RouteOne. When she is not busy with work and family, she enjoys helping others to develop a love for code.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/starangel75"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/astahre/"
        }
      ]
    }
  ],
  "room": "Salon A",
  "track": "Teams & Collaboration",
  "tags": [
    "Soft Skills",
    "Teams",
    "Code Quality"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Thursday",
  "startTime": "16:45",
  "endTime": "17:45",
  "excerpt": "As software developers, our goal is to typically write software that meets the needs of our clients, whether they be internal or external clients. Often times, when we miss the mark, it is due to a communication breakdown between the developer team and the client team on what the actual requirements...",
  "description": "As software developers, our goal is to typically write software that meets the needs of our clients, whether they be internal or external clients. Often times, when we miss the mark, it is due to a communication breakdown between the developer team and the client team on what the actual requirements are.\n\nCommunication breakdowns generally occur between people with different communication styles. So how do we bridge that gap and get the information we need from people who communicate differently than we do?\n\nThis talk will be an exploration of communication styles and how we can recognize our own communication style as well as easily determine the communication style of others. With this information we can communicate with someone in the style in which they best receive information. When we communicate with others in their learning style, we break down barriers and are more able to accurately get to the pain points that they need a solution for. Once the communication barriers are down, it becomes easier to get the requirements that we are looking for."
}