{
  "id": "537211",
  "title": "Isn't it time to ditch code coverage? Focus on high value tests instead",
  "speakers": [
    {
      "id": "7d4faa6b-cbf0-4373-8fce-fabc29ed88f7",
      "name": "Stephen Odell",
      "photo": "https://sessionize.com/image/0e20-400o400o1-np9uXyE8aQ14DUxN2HTbgu.jpg",
      "bio": "Steve is the VP of Engineering at Viagio Technologies, a Top 10 Small Business in KC that focuses on helping their clients bring to fruition their product ideas through software development. Steve has a strong passion for technology and loves to learn new languages, frameworks, and ways of doing things. He has a strong drive to build software that finds the right balance between pragmatism and high quality software design principles. His passion for technology is only exceeded by his passion for leadership and helping other people grow and flourish in their own careers.",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/steve-odell-57365a16/"
        }
      ]
    }
  ],
  "room": "Nile",
  "track": "Software Quality",
  "tags": [
    "Automation",
    "Code Quality",
    "QA Testing"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Thursday",
  "startTime": "10:30",
  "endTime": "11:30",
  "excerpt": "As engineers, it can be difficult to use metrics to measure the value of what we do. One metric that typically falls short is code coverage because it can’t measure how WELL our application has been tested, rather, it focuses how MUCH has been tested. What if we ditched this traditional metric and...",
  "description": "As engineers, it can be difficult to use metrics to measure the value of what we do. One metric that typically falls short is code coverage because it can’t measure how WELL our application has been tested, rather, it focuses how MUCH has been tested. What if we ditched this traditional metric and focused on what’s truly valuable instead?\n\nIn this talk, we will employ a testing strategy that provides higher  value than traditional code coverage strategies. This strategy will center around a hyper focus of writing HIGH VALUE tests. These are tests that have longevity and build true confidence in the quality of your application. As a software or QA engineer, you will walk away  with a greater understanding of when to employ different types of tests (unit, e2e, integration, etc.) so that they are providing high value rather than chasing code coverage."
}