{
  "id": "537289",
  "title": "GPT Embeddings - Not Magic, Just Math",
  "speakers": [
    {
      "id": "1aeeb749-1d7f-4bf8-be80-6c78ab20429a",
      "name": "Barry Stahl",
      "photo": "https://sessionize.com/image/8177-400o400o1-49-1d7f-4bf8-be80-6c78ab20429a.283d3e7b-2ac4-4bb2-89cd-b36cfcf5a465.jpg",
      "bio": "Barry (he/him/his) is a .NET Software Engineer who has been creating business solutions for enterprise customers for more than 30 years. Barry is also an Election Integrity Activist, baseball and hockey fan, husband of one genius and father of another, and a 30+ year resident of Phoenix Arizona USA. When Barry is not traveling around the world to speak at Conferences, Code Camps and User Groups or to participate in GiveCamps, he spends his days as a Solution Architect for Carvana and his nights thinking about the next Arizona GiveCamp, an annual event where software developers come together to build websites and apps for some great non-profit organizations.",
      "links": []
    }
  ],
  "room": "Salon B",
  "track": "Data",
  "tags": [
    "C#",
    "Machine Learning",
    "Data Science"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Thursday",
  "startTime": "11:45",
  "endTime": "12:45",
  "excerpt": "Embeddings may be the least understood yet most valuable tool to come out of the world of Large Language Models. In this presentation, we will unravel the mystery of embeddings, emphasizing their mathematical foundations and practical applications. \n\nWe'll start by discussing what embeddings are,...",
  "description": "Embeddings may be the least understood yet most valuable tool to come out of the world of Large Language Models. In this presentation, we will unravel the mystery of embeddings, emphasizing their mathematical foundations and practical applications.\n\nWe'll start by discussing what embeddings are, and what they represent. Then we'll delve into the variety of tools we have to compare and contrast them, including Cosine similarity and distance, as well as clustering. Then we'll put those tools to use creating powerful applications that go beyond just typical chat and analytics use-cases. Because we'll be focusing on operational use-cases, code demos will be done using C# rather than Python.\n\nAttendees will leave with a deeper understanding of the mathematical underpinnings of embeddings, practical knowledge of how to use them, and an appreciation for their value in our applications. This session is ideal for developers, data scientists, and anyone interested in the mathematical underpinnings of machine learning and natural language processing."
}