{
  "id": "537209",
  "title": "Be an Ally for Mobile A11y",
  "speakers": [
    {
      "id": "e32a96ab-aa07-4fa2-9432-441fc1288e88",
      "name": "Rachael Yomtoob",
      "photo": "https://sessionize.com/image/576c-400o400o1-Ht7W7XaFWCoqnS5QooBe4r.jpg",
      "bio": "Rachael discovered their passion for accessibility while working on a project team at the University of Michigan that developed an Android application to provide indoor navigation for people with visual disabilities. They joined the mobile team at Deque in 2018 as a web developer where they got to learn about both mobile and web accessibility before transitioning to a product owner. Aside from being a digital accessibility professional, Rachael is a proud cat parent to three fur babies and enjoys spending their free time at hot yoga classes or diamond painting.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/ranchaeley"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/rachael-yomtoob/"
        },
        {
          "title": "Company Website",
          "url": "https://deque.com"
        }
      ]
    }
  ],
  "room": "Salon B",
  "track": "Mobile",
  "tags": [
    "Mobile",
    "Accessibility"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Thursday",
  "startTime": "8:00",
  "endTime": "9:00",
  "excerpt": "Accessibility for the web has gained visibility in the last few years, but what about mobile apps? Let's talk about why making your mobile app accessible is just as important, if not more important, than building an accessible website. I'll introduce how digital accessibility standards like the Web...",
  "description": "Accessibility for the web has gained visibility in the last few years, but what about mobile apps? Let's talk about why making your mobile app accessible is just as important, if not more important, than building an accessible website. I'll introduce how digital accessibility standards like the Web Content Accessibility Guidelines (WCAG) can apply to the mobile ecosystem, and what technologies and tools are available for building accessible apps."
}