{
  "id": "537342",
  "title": "Hybrid Agility: Working Conditions for Team Success",
  "speakers": [
    {
      "id": "018de97f-4449-4733-aa0f-cb30a7839ab8",
      "name": "Carina Silfverduk",
      "photo": "https://sessionize.com/image/2095-400o400o1-9ouoN4LbD1hdD9U2TmAoxF.jpg",
      "bio": "Carina Silfverduk is the Practice Lead for Agility and a lean six sigma black belt at CAS, a division of the American Chemical Society. She works for Technology Continual Improvement driving positive change throughout the organization.\n \n Carina is first and foremost a lifelong learner; she's an avid reader and who likes working with, learning from and helping others. She is aggressively curious and loves collaborating towards meaningful shared goals.\n \n Agile and Lean since 2003 first as an XP developer then a scrum master/dev and finally as a coach, Carina co-leads the Women in Agile Columbus Chapter.",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/silfverduk/"
        }
      ]
    }
  ],
  "room": "Salon E",
  "track": "Teams & Collaboration",
  "tags": [
    "Soft Skills",
    "Agile",
    "Teams"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Thursday",
  "startTime": "10:30",
  "endTime": "11:30",
  "excerpt": "Is your team or workplace working hybrid, with some in the office and some remote on any given day? Working hybrid is by far harder than either remote or on-site work because you need to accommodate both and then do something extra to keep everyone in the room and everyone on the call engaged.\n\nHow...",
  "description": "Is your team or workplace working hybrid, with some in the office and some remote on any given day? Working hybrid is by far harder than either remote or on-site work because you need to accommodate both and then do something extra to keep everyone in the room and everyone on the call engaged.\n\nHow do you ensure that teammates can all contribute and there’s nothing left unsaid? What techniques can you use to put everyone on equal footing when your teammates are across an ocean or still finishing Monday’s work when you start your day on Tuesday?\n\nWorking hybrid is a muscle that needs strengthened in order to unlock inclusion and diversity of thought for all team members no matter their location. Join this session to learn ways to build your ‘working hybrid’ muscle, smooth the way for hybrid work and ensure you are including and engaging all of your colleagues and your team."
}