{
  "id": "537350",
  "title": "Clean Architecture with ASP.NET Core 8",
  "speakers": [
    {
      "id": "a5d50f4e-f021-4983-97a9-73f9415b3d5b",
      "name": "Steve Smith",
      "photo": "https://sessionize.com/image/2328-400o400o1-4e-f021-4983-97a9-73f9415b3d5b.34dc742e-9a1e-4c87-98ad-c6bae9a07972.jpg",
      "bio": "Steve Smith (@ardalis) is an entrepreneur and software developer with a passion for building quality software as effectively as possible. Steve has published several courses on Pluralsight, covering DDD, SOLID, design patterns, and software architecture. He's a Microsoft ASP.NET MVP and Insider, a frequent speaker at developer conferences, an author, and a trainer.\n \n Steve works with companies that want to avoid the trap of technical debt by helping their teams deliver quality software, quickly. Steve and his team have been described by clients as a \"force multiplier\", amplifying the value of existing development teams. Steve's client list includes Microsoft, Quicken Loans, Celina Insurance, and many other satisfied customers.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/ardalis"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/stevenandrewsmith"
        },
        {
          "title": "Blog",
          "url": "https://ardalis.com/blog"
        },
        {
          "title": "Company Website",
          "url": "https://nimblepros.com"
        }
      ]
    }
  ],
  "room": "Orange",
  "track": "Architecture",
  "tags": [
    ".NET",
    "C#",
    "Backend",
    "Object Oriented Programming",
    "Programming Principles",
    "Architecture",
    "System Design",
    "Code Quality"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Friday",
  "startTime": "9:45",
  "endTime": "10:45",
  "excerpt": "Clean Architecture is a very popular approach for DDD and Microservices, and for good reason. It's not a new approach, and went by other names in the past (e.g. Onion, Hexagonal, Ports-and-Adapters). One of the main benefits of the approach is its focus on business logic and its reduction in...",
  "description": "Clean Architecture is a very popular approach for DDD and Microservices, and for good reason. It's not a new approach, and went by other names in the past (e.g. Onion, Hexagonal, Ports-and-Adapters). One of the main benefits of the approach is its focus on business logic and its reduction in coupling to external infrastructure concerns (databases, web APIs, etc.)\n\nIn this session, you'll learn the principles behind Clean Architecture and how to apply it to real world apps built with the latest version of ASP.NET Core. You'll leave with a solution template you can use to get started on new projects with a working Clean Architecture solution in minutes!"
}