{
  "id": "537301",
  "title": "Survival Under Fire: How to Stay Whole During Adversity",
  "speakers": [
    {
      "id": "fdf3c776-f100-41f5-bb22-7a1f16710740",
      "name": "Arthur Doler",
      "photo": "https://sessionize.com/image/96f7-400o400o1-76-f100-41f5-bb22-7a1f16710740.7bb72794-a6ce-4d42-9c25-bd158fed902c.jpg",
      "bio": "Arthur (or Art, take your pick) has been a software engineer for 19 years and has worked on things as exciting as analysis software for casinos and things as boring as banking websites. He is an advocate for talking openly about mental health and psychology in the technical world, and he spends a lot of time thinking about how we program and why we program, and about the tools, structures, cultures, and mental processes that help and hinder us from our ultimate goal of writing amazing things. His hair is brown and his thorax is a shiny blue color.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/arthurdoler"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/arthurdoler/"
        },
        {
          "title": "Blog",
          "url": "https://arthurdoler.com"
        },
        {
          "title": "Company Website",
          "url": "https://aviture.us.com"
        }
      ]
    }
  ],
  "room": "Salon G",
  "track": "Teams & Collaboration",
  "tags": [
    "Soft Skills",
    "Teams"
  ],
  "format": "General Session",
  "level": "Introductory and overview",
  "day": "Thursday",
  "startTime": "10:30",
  "endTime": "11:30",
  "excerpt": "Each of the last few years have hit like a brick to the temple. It felt like the entire world was upended. There’s been radical shifts in the way we work, endless video conference calls, social and political unrest, and lots of tough choices about our health and the health of those we love and...",
  "description": "Each of the last few years have hit like a brick to the temple. It felt like the entire world was upended. There’s been radical shifts in the way we work, endless video conference calls, social and political unrest, and lots of tough choices about our health and the health of those we love and care about. In short, it’s been a complete trainwreck of psychological trauma, with no clear signs of when normality will ever return. In times like this, it might feel like there’s nothing you can do but hold on for dear life.\n\nBut there *are* things you can do. You can start to understand what happened to your brain during this time. You can figure out how your brain handles traumatic events like this, learn how to recover as things slowly start to get better, and you can begin to prepare yourself for future crises. Take the time to make your brain your ally, and you won’t be fighting it during the next crisis that comes along."
}