{
  "id": "537404",
  "title": "Neurodiverse Coders: Unlocking ADHD & Autism Superpowers in Tech",
  "speakers": [
    {
      "id": "f61ba4e7-cac6-4a27-8dc8-b476a51466d9",
      "name": "Gaines Kergosien",
      "photo": "https://sessionize.com/image/319d-400o400o1-HZRPNMVTu9q5SW1LjszG19.jpg",
      "bio": "With over two decades in the tech sector, Gaines stands out as a leader adept at aligning innovative technological solutions with strategic business goals. His accomplishments span transformative software development, infrastructure enhancements, and the integration of agile methodologies to optimize development processes.\n \n In leadership positions within leading global corporations, Gaines's impact was amplified by his knack for maximizing the potential of his teams. It was under his guidance that his organizations experienced significant shifts towards agile practices, yielding marked improvements in both development quality and operational efficiency.\n \n Beyond his corporate roles, Gaines's commitment to knowledge-sharing shines through with the inception of the Music City Code conference. Guiding a dedicated team of community volunteers, he expanded the event, introducing related conferences spotlighting agile techniques and emerging data trends. Music City Tech rapidly established itself as a prime destination for professional development and networking.\n \n When addressing audiences, Gaines excels in demystifying complex subjects, offering actionable insights. His presentations, celebrated for their precision and applicability, have engaged local and global audiences alike, underscoring his dedication to fostering continuous learning in the tech community.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/gainesk"
        },
        {
          "title": "LinkedIn",
          "url": "http://www.linkedin.com/in/gainesk/"
        },
        {
          "title": "Company Website",
          "url": "https://trailheadtechnology.com/about-us/our-team/#our-leadership-team"
        }
      ]
    }
  ],
  "room": "Orange",
  "track": "Career Development",
  "tags": [
    "Career Development",
    "Diversity/Equity/Inclusion",
    "Soft Skills",
    "Leadership",
    "Teams"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Thursday",
  "startTime": "8:00",
  "endTime": "9:00",
  "excerpt": "In the tech world, diversity isn't just about backgrounds; it's also about how we think and process information. ADHD and Autism Spectrum Disorder (ASD) are often pigeonholed as challenges. However, what if we told you that these so-called 'disorders' house superpowers that can be game-changers in...",
  "description": "In the tech world, diversity isn't just about backgrounds; it's also about how we think and process information. ADHD and Autism Spectrum Disorder (ASD) are often pigeonholed as challenges. However, what if we told you that these so-called 'disorders' house superpowers that can be game-changers in the realm of coding and software development?\n\nJoin us as we delve into the remarkable abilities often associated with ADHD and ASD - like laser-sharp focus, unparalleled attention to minutiae, and a natural flair for discerning patterns. More than just a session, this is a call to action: to shift our industry paradigm from focusing on perceived deficits to recognizing and leveraging these neurodiverse strengths.\n\nDuring this session, attendees will:\n- Gain insights into how traits associated with ADHD and ASD can be massive assets in the tech and coding environment.\n- Learn strategies to nurture and harness these neurodiverse strengths, creating a more inclusive and effective workplace.\n- Challenge and reshape their perceptions about neurodiversity, emphasizing a strengths-first approach."
}