{
  "id": "537432",
  "title": "The Vue.js Power Hour: Building a Dynamic Frontend in < 60 Minutes",
  "speakers": [
    {
      "id": "3973e7f0-7d80-44cb-8831-b996f73f75f2",
      "name": "Tori Brenneison",
      "photo": "https://sessionize.com/image/ca9a-400o400o1-GqbwYws9d2eRn72hhA56Zr.jpg",
      "bio": "Tori Brenneison is a programming instructor, software dev, and former art historian whose purpose in life is to serve as a warning to others. When not teaching full-stack development to the rockstar career changers at Tech Elevator and doing her absolute best to promote diversity in the technology field, she can usually be found hiking, petting strange dogs, or admiring her collection of midcentury bakeware. Best to approach her in the wild with a sacrificial cup of coffee, and be forewarned: she's a hugger.",
      "links": [
        {
          "title": "Twitter",
          "url": "http://www.twitter.com/not_unambitious"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/toribrenneison/"
        },
        {
          "title": "Blog",
          "url": "https://www.codemom.com"
        },
        {
          "title": "Company Website",
          "url": "https://www.techelevator.com"
        }
      ]
    }
  ],
  "room": "Salon A",
  "track": "Web/Front-End",
  "tags": [
    "Javascript",
    "Front End"
  ],
  "format": "General Session",
  "level": "Intermediate",
  "day": "Friday",
  "startTime": "8:30",
  "endTime": "9:30",
  "excerpt": "Are you a beginner developer who is curious about JS component frameworks? A backend developer who wants to add a frontend skill to their toolbox? A data analyst looking for a quick way to build views? Have we got a deal for you!\n\nVue.js is a relatively straightforward and increasingly popular...",
  "description": "Are you a beginner developer who is curious about JS component frameworks? A backend developer who wants to add a frontend skill to their toolbox? A data analyst looking for a quick way to build views? Have we got a deal for you!\n\nVue.js is a relatively straightforward and increasingly popular JavaScript component framework. It has become a developer favorite for being easy to use, lightning fast, highly flexible, and quick to learn.\n\nJoin a professional development instructor as they cover the absolute bare-bones basics of Vue... in under an hour. We'll go from a static page to a dynamic frontend by covering components, directives, and data binding.\n\nThis session is perfect for beginner and intermediate developers who are looking to learn -just enough- Vue to be dangerous. Don't miss out on this opportunity to start building with Vue.js in only 60 minutes (or less)!"
}