{
  "id": "538027",
  "title": "Build your own AI sidekick with Azure AI, Semantic Kernel, and .NET 8",
  "speakers": [
    {
      "id": "17c299ee-d9fd-4020-b499-2837b2b3a2bf",
      "name": "Matt Eland",
      "photo": "https://sessionize.com/image/2af0-400o400o1-MX2vxaEVrGpQGHyA3VRMRr.png",
      "bio": "Matt Eland is a software engineering leader and data scientist who has served as a senior engineer, software engineering manager, professional programming instructor, and has helped build enterprise-level software at a variety of organizations before distinguishing himself as a Microsoft MVP in Artificial Intelligence by using technology to accomplish ridiculous things in the name of science and teaching others.\n \n Matt makes it his job to learn new things and share them with others through articles, videos, and talks at user groups and conferences covering a wide range of topics from software architecture to programming topics to artificial intelligence and data science. \n \n Matt is a current data analytics master's student, an AI Specialist at Leading EDJE, wrote \"Refactoring with C#\" and occasionally sleeps as well.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/IntegerMan"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/matteland/"
        },
        {
          "title": "Blog",
          "url": "https://AccessibleAI.dev"
        },
        {
          "title": "Company Website",
          "url": "https://TechElevator.com"
        }
      ]
    },
    {
      "id": "62b5c0da-ecfa-4566-8ce2-4eeb8e2d321d",
      "name": "Samuel Gomez",
      "photo": "https://sessionize.com/image/b9e8-400o400o1-K6649gMDEzkWxFkUQLE8Bm.jpg",
      "bio": "I've worked in software development for 13 years (mostly Microsoft technologies) and love the problem solving aspect of the work. In recent years have become very passionate about AI and machine learning technologies and how they can be applied to different aspects of our lives. When not coding I enjoy spending time with my family, soccer (watching, playing and coaching), playing videogames and watching movies.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/thesoccerdev"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/samueljgomez/"
        },
        {
          "title": "Company Website",
          "url": "https://geneca.com/"
        }
      ]
    }
  ],
  "room": "Cypress",
  "track": "Data",
  "tags": [
    "C#",
    "Cloud",
    "Data Science"
  ],
  "format": "PreCompiler",
  "level": "Intermediate",
  "day": "Tuesday",
  "startTime": "8:00",
  "endTime": "12:00",
  "excerpt": "Are you a budding super hero or super villain* but you feel like you're lacking that AI companion to help you reach that next level? Have you ever wanted to see what AI can do to help your daily life? Do you have an interesting application that would just be so much better with a little artificial...",
  "description": "Are you a budding super hero or super villain* but you feel like you're lacking that AI companion to help you reach that next level? Have you ever wanted to see what AI can do to help your daily life? Do you have an interesting application that would just be so much better with a little artificial intelligence? Don't fear, because of course there's a PreCompiler for that.\n\nIn this half-day workshop we'll see how to build enterprise-level AI applications by integrating AI vision, speech, and large language models into an app. We'll start out simple by seeing how to work with these APIs on their own before layering them together with Semantic Kernel to form an AI system capable of planning complex tasks involving external data and APIs.\n\nBy the time we're done, you'll have a better understanding of what AI can do and see how easy it is to integrate it into your applications. You'll also be that much closer to super hero / super villain* status with a modular personal AI companion of your very own to continue extending after CodeMash is over.\n\n* CodeMash does not endorse acts of villainy including but not limited to taking over the world and/or the Kalahari."
}