{
  "id": "582452",
  "title": "Off The Shelf AI (Part 2)",
  "speakers": [
    {
      "id": "468d2621-a815-4e39-8c07-6c18162c9b1a",
      "name": "Jordan Thayer",
      "photo": "https://sessionize.com/image/5a3f-400o400o1-hZemfRHbjV6ghaTgqR8HDm.jpg",
      "bio": "Jordan Thayer received their PhD in Artificial Intelligence in 2012 from the University of New Hampshire. Ever since, they've been applying artificial intelligence in academia and industry to problems including intrusion detection, planning, static analysis, and program generation.\n \n As a thought leader at SEP, they’ve been proving that AI isn't futuristic technology. Rather, it's a collection of techniques of varying levels of maturity that can often reliably solve problems they have today. They give talks, runs workshop, visualize algorithm behavior, and build proofs of concept as well as products to show what AI can do already.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/drbass"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/jordan-seabass-thayer/"
        },
        {
          "title": "Blog",
          "url": "https://sep.com/blog/author/jordan-thayer/"
        }
      ]
    },
    {
      "id": "3963f1e7-00c7-47ba-9c88-9f1d9be28b43",
      "name": "Robert Herbig",
      "photo": "https://sessionize.com/image/8e29-400o400o1-nntDrhduMjHZ856ok5W8wD.jpg",
      "bio": "Robert Herbig is passionate about leading teams to deliver products users love.\n \n He is a Lead Software Engineer at SEP, a software product design and development company. In his 15+ years in the software industry, he has worked on products ranging in size from small apps to enterprise systems; embedded, desktop, web, and cloud platforms; and in a variety of markets and domains including aerospace, medical, agriculture, construction, and secure communication.\n \n As an AI Practice Lead at SEP, he strives to educate clients and peers about what AI can do, identify complex problems AI can address in whole or in part, and incorporate AI into software products that make a difference for their users.\n \n He currently lives in Carmel, Indiana with his wonderful wife, three rambunctious sons, and three dogs.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/RobertHerbig"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/RobertHerbig"
        },
        {
          "title": "Blog",
          "url": "https://www.RobertHerbig.com/"
        }
      ]
    }
  ],
  "room": "Indigo Bay",
  "track": "Data",
  "tags": [
    "Python",
    "Programming Principles",
    "Machine Learning"
  ],
  "format": "PreCompiler",
  "level": "Introductory and overview",
  "day": "Wednesday",
  "startTime": "13:00",
  "endTime": "17:00",
  "excerpt": "Hearing about artificial intelligence is unavoidable these days if you’re watching the news or staying abreast of the technical sector. We frequently hear about the power of AI-enabled tools, and are shown soundbytes of experts extolling the virtues of their approach.\n\nWhile these stories inform...",
  "description": "Hearing about artificial intelligence is unavoidable these days if you’re watching the news or staying abreast of the technical sector. We frequently hear about the power of AI-enabled tools, and are shown soundbytes of experts extolling the virtues of their approach.\n\nWhile these stories inform and entertain, they also create the perception that AI i s extremely difficult and exclusively the realm of experts, which simply isn’t true! These days we do not need to be an AI expert to reap the benefits of the research community. Off-the-shelf open source tools exist which are powerful enough to solve many industrial problems.\n\nIn this workshop we will map business problems to tools and show how to translate a problem domain into the expected input of the tool. Using these tools will help us identify development opportunities that we might have otherwise missed and save time by not re-implementing common solving techniques.\n\nThe workshop is split between lecture portions, where we talk about common problems, formalisms, and historical applications and hands on sections where we work through demos and exercises of open source tools solving the kinds of problems we just discussed.\n\nWe’ll cover the following broad topics and tools:\n\nThree major types of AI problems:\n* Processing Natural Language\n* Making Sense of Data\n* Building Controllers for Automated Systems (e.g. Robots)\n\nSeveral off-the-shelf tools that can tackle these problems:\n* ChatGPT\n* VADER Sentiment Analysis\n* scikit-learn\n* PyTorch\n* Gymnasium (formerly OpenAI Gym)\n"
}