{
  "id": "582445",
  "title": "Mastering Solutions Architecture with Design Katas (Part 2)",
  "speakers": [
    {
      "id": "f61ba4e7-cac6-4a27-8dc8-b476a51466d9",
      "name": "Gaines Kergosien",
      "photo": "https://sessionize.com/image/319d-400o400o1-HZRPNMVTu9q5SW1LjszG19.jpg",
      "bio": "With over two decades in the tech sector, Gaines stands out as a leader adept at aligning innovative technological solutions with strategic business goals. His accomplishments span transformative software development, infrastructure enhancements, and the integration of agile methodologies to optimize development processes.\n \n In leadership positions within leading global corporations, Gaines's impact was amplified by his knack for maximizing the potential of his teams. It was under his guidance that his organizations experienced significant shifts towards agile practices, yielding marked improvements in both development quality and operational efficiency.\n \n Beyond his corporate roles, Gaines's commitment to knowledge-sharing shines through with the inception of the Music City Code conference. Guiding a dedicated team of community volunteers, he expanded the event, introducing related conferences spotlighting agile techniques and emerging data trends. Music City Tech rapidly established itself as a prime destination for professional development and networking.\n \n When addressing audiences, Gaines excels in demystifying complex subjects, offering actionable insights. His presentations, celebrated for their precision and applicability, have engaged local and global audiences alike, underscoring his dedication to fostering continuous learning in the tech community.",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/gainesk"
        },
        {
          "title": "LinkedIn",
          "url": "http://www.linkedin.com/in/gainesk/"
        },
        {
          "title": "Company Website",
          "url": "https://trailheadtechnology.com/about-us/our-team/#our-leadership-team"
        }
      ]
    },
    {
      "id": "f46fcf13-76db-4850-9995-ac8d076ba1de",
      "name": "Eric Potter",
      "photo": "https://sessionize.com/image/cc5e-400o400o1-RHPaZf2AMz7uxXzeTKj3G.jpg",
      "bio": "Eric is the Director of Technical Education for Sweetwater and a Microsoft MVP for Visual Studio and Development Technologies. He works primarily in the .Net web platform but loves opportunities to try out other stacks. He has been developing high-quality custom software solutions since 2001. He has successfully delivered solutions for clients in a wide variety of industries. He loves to dabble in new and exciting technologies. In his spare time, he loves to tinker with Arduino projects. He fondly remembers what it was like to develop software for the Palm OS. He has an amazing wife and 5 wonderful children. He blogs at http://humbletoolsmith.com/ and you can follow him on Twitter as @pottereric. \n",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/pottereric"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/ericbpotter/"
        },
        {
          "title": "Blog",
          "url": "http://humbletoolsmith.com/"
        },
        {
          "title": "Company Website",
          "url": "https://humbletoolsmith.com"
        }
      ]
    }
  ],
  "room": "Nile",
  "track": "DevOps",
  "tags": [
    "Agile",
    "Project Management",
    "Teams"
  ],
  "format": "PreCompiler",
  "level": "Intermediate",
  "day": "Tuesday",
  "startTime": "13:00",
  "endTime": "17:00",
  "excerpt": "TLDR: Architects get relatively few opportunities to practice their craft, so we will group up to formulate architectural visions for \"real world\" business problems. Attendees will then evaluate each group's solution to gain insight into the pros and cons of different approaches.\n\nFred Brooks said,...",
  "description": "TLDR: Architects get relatively few opportunities to practice their craft, so we will group up to formulate architectural visions for \"real world\" business problems. Attendees will then evaluate each group's solution to gain insight into the pros and cons of different approaches.\n\nFred Brooks said, \"How do we get great designers? Great designers design, of course.\" So how do we get great architects? Great architects architect, but architecting a software system is a rare opportunity for the non-architect. For this, we turn to an ancient tradition, born of the martial arts, designed to give the student the opportunity to practice more than basics in a semi-realistic way. The coding kata, created by Dave Thomas, is an opportunity for the developer to try a language or tool to solve a problem slightly more complex than \"Hello world\". The architectural kata, like the coding kata, is an opportunity for the student-architect to practice architecting a software system.\n\nIn this workshop, attendees will be split into small groups and given a \"real world\" business problem (the kata). Attendees will be expected to formulate an architectural vision for the project, asking questions (of the instructor) as necessary to better understand the requirements, then defend questions (posed by both the instructor and their fellow attendees) about their choice in technology and approach, and then evaluate others' efforts in a similar fashion. No equipment is necessary to participate--the great architect has no need of tools, just their mind and the customers' participation and feedback."
}