{
  "id": "586366",
  "title": "A Kid's World of 3D printing and CAD (Tuesday)",
  "speakers": [
    {
      "id": "2f918be7-e87e-4636-8132-6284e77f8fee",
      "name": "Brian Carnes",
      "photo": "https://sessionize.com/image/a875-400o400o1-pZBadYf9yUdKA4hWHX5dDm.jpg",
      "bio": "Brian is professional creative based out of Dublin Ohio. In addition to to being a lifelong artist, he also worked for over 20 years on various IT support/infrastructure engineering teams. He runs a small studio business as well as working on various freelance and consulting projects involving digital sculpting, emerging technology, gamification, additive manufacturing, and 3D printing! His studio, Sea Dog Game Studios, is a publisher/maker of tabletop games and accessories. He is the game designer, author, and sculptor for “Sailpower: Fun Scale Combat in the Age of Sail,” a tabletop miniature ship combat game first released in 2005. He also is the owner of Valkyrie Pewter, a renaissance and fantasy pewter hand-sculpted and handcrafted jewelry maker sold at retail shops at the Ohio Renaissance Festival and Great Lakes Medieval fair. Brian hopes to be a voice for 3D printing, and agile short run customer reactive manufacturing (Industry 4.0) and empower people of all ages with the tools to bring ideas to life through CAD and 3D printing.",
      "links": [
        {
          "title": "Blog",
          "url": "https://www.seadoggamestudios.com/"
        }
      ]
    }
  ],
  "room": "Crown Palm",
  "track": "KidzMash",
  "tags": [],
  "format": "KidzMash Divez",
  "level": "",
  "day": "Tuesday",
  "startTime": "8:30",
  "endTime": "10:00",
  "excerpt": "This session is targeted for children. All ages of children are welcome based on their ability to enjoy the content being offered! Children must have a responsible adult present. We will talk about and watch videos about the exciting world of 3D printing. We will tour the 3D printer lab and look at...",
  "description": "This session is targeted for children. All ages of children are welcome based on their ability to enjoy the content being offered! Children must have a responsible adult present. We will talk about and watch videos about the exciting world of 3D printing. We will tour the 3D printer lab and look at the printers as well as models made on them We will also go over basics of how to make models and different types of CAD apps including some that are free or more kid friendly as well as looking at more professional apps as well. We’ll also discuss where to get free models and where to print them. This is the basic overview. Kids should start with this session before using the lab or doing the follow-up modeling course."
}