{
  "id": "586457",
  "title": "From idea to physical series: A basic overview of the world of CAD and 3D printing (Wednesday)",
  "speakers": [
    {
      "id": "2f918be7-e87e-4636-8132-6284e77f8fee",
      "name": "Brian Carnes",
      "photo": "https://sessionize.com/image/a875-400o400o1-pZBadYf9yUdKA4hWHX5dDm.jpg",
      "bio": "Brian is professional creative based out of Dublin Ohio. In addition to to being a lifelong artist, he also worked for over 20 years on various IT support/infrastructure engineering teams. He runs a small studio business as well as working on various freelance and consulting projects involving digital sculpting, emerging technology, gamification, additive manufacturing, and 3D printing! His studio, Sea Dog Game Studios, is a publisher/maker of tabletop games and accessories. He is the game designer, author, and sculptor for “Sailpower: Fun Scale Combat in the Age of Sail,” a tabletop miniature ship combat game first released in 2005. He also is the owner of Valkyrie Pewter, a renaissance and fantasy pewter hand-sculpted and handcrafted jewelry maker sold at retail shops at the Ohio Renaissance Festival and Great Lakes Medieval fair. Brian hopes to be a voice for 3D printing, and agile short run customer reactive manufacturing (Industry 4.0) and empower people of all ages with the tools to bring ideas to life through CAD and 3D printing.",
      "links": [
        {
          "title": "Blog",
          "url": "https://www.seadoggamestudios.com/"
        }
      ]
    }
  ],
  "room": "Crown Palm",
  "track": "Makerspace",
  "tags": [],
  "format": "Makerspace",
  "level": "Introductory and overview",
  "day": "Wednesday",
  "startTime": "13:00",
  "endTime": "14:00",
  "excerpt": "This session will talk about the exciting world of 3D printing. We will go over exciting trends and happenings in the 3D printing world. We’ll then cover choosing a CAD app and will briefly cover using curated 3D printer object libraries and different CAD apps that might be more appropriate to...",
  "description": "This session will talk about the exciting world of 3D printing. We will go over exciting trends and happenings in the 3D printing world. We’ll then cover choosing a CAD app and will briefly cover using curated 3D printer object libraries and different CAD apps that might be more appropriate to different types of projects. We will also cover different types of 3d printers as well as advantages and disadvantages of 3d printing services. After this session you’ll have the starting point on how to make models, where to get them if the model already exists, and where to print them. If you have heard of the exciting world of CAD and 3D printing but have never tried it or would like a basic overview, this session is for you!"
}