{
  "id": "586469",
  "title": "From idea to physical series: CAD and 3D printing in Jewelry (open to Adults and Kidz)",
  "speakers": [
    {
      "id": "2f918be7-e87e-4636-8132-6284e77f8fee",
      "name": "Brian Carnes",
      "photo": "https://sessionize.com/image/a875-400o400o1-pZBadYf9yUdKA4hWHX5dDm.jpg",
      "bio": "Brian is professional creative based out of Dublin Ohio. In addition to to being a lifelong artist, he also worked for over 20 years on various IT support/infrastructure engineering teams. He runs a small studio business as well as working on various freelance and consulting projects involving digital sculpting, emerging technology, gamification, additive manufacturing, and 3D printing! His studio, Sea Dog Game Studios, is a publisher/maker of tabletop games and accessories. He is the game designer, author, and sculptor for “Sailpower: Fun Scale Combat in the Age of Sail,” a tabletop miniature ship combat game first released in 2005. He also is the owner of Valkyrie Pewter, a renaissance and fantasy pewter hand-sculpted and handcrafted jewelry maker sold at retail shops at the Ohio Renaissance Festival and Great Lakes Medieval fair. Brian hopes to be a voice for 3D printing, and agile short run customer reactive manufacturing (Industry 4.0) and empower people of all ages with the tools to bring ideas to life through CAD and 3D printing.",
      "links": [
        {
          "title": "Blog",
          "url": "https://www.seadoggamestudios.com/"
        }
      ]
    }
  ],
  "room": "Crown Palm",
  "track": "Makerspace",
  "tags": [],
  "format": "Makerspace",
  "level": "Intermediate",
  "day": "Tuesday",
  "startTime": "16:00",
  "endTime": "18:00",
  "excerpt": "Want to make something more advanced than the ones you made in the basic overview? We have some additional options to expand model building skills for those who have been through our previous sessions. \n\nNEW for this year we are offering a deeper dive into the process of making jewelry with CAD and...",
  "description": "Want to make something more advanced than the ones you made in the basic overview? We have some additional options to expand model building skills for those who have been through our previous sessions.\n\nNEW for this year we are offering a deeper dive into the process of making jewelry with CAD and 3D printing. We will go over a brief presentation about various ways of making jewelry from CAD models and then we will transition into a more advanced Rhino model-building walk-through session to build a pendant that would work for casting. These models can be printed out on our resin printers.\n\nOpen to anyone (kids or adults) who have gone through the regular introductory sessions. PLEASE NOTE this session assumes you have taken the basic overview classes OR are reasonably comfortable working in Rhino3D.\n\nThis session will run on Tuesday, after the adult session from 4-6pm.  After we get some of the models printed, we plan to offer a tech demo of the process of using Delft Clay to take an impression from the 3D models. This will likely occur on Wednesday evening at around 8PM.\n\nPLEASE NOTE: This is a session that is likely to have both kid and adult attendees. If your child has attended the introductory class and is looking for a chance to make something more complex, they are welcome in this class. It is likely best for High School aged teens or late junior high aged students, but any kid that has completed the introductory class without issue and is able to follow a slightly faster paced class may also attend."
}