{
  "id": "586422",
  "title": "A Kid's introduction to 3D Modeling (Tuesday)",
  "speakers": [
    {
      "id": "2f918be7-e87e-4636-8132-6284e77f8fee",
      "name": "Brian Carnes",
      "photo": "https://sessionize.com/image/a875-400o400o1-pZBadYf9yUdKA4hWHX5dDm.jpg",
      "bio": "Brian is professional creative based out of Dublin Ohio. In addition to to being a lifelong artist, he also worked for over 20 years on various IT support/infrastructure engineering teams. He runs a small studio business as well as working on various freelance and consulting projects involving digital sculpting, emerging technology, gamification, additive manufacturing, and 3D printing! His studio, Sea Dog Game Studios, is a publisher/maker of tabletop games and accessories. He is the game designer, author, and sculptor for “Sailpower: Fun Scale Combat in the Age of Sail,” a tabletop miniature ship combat game first released in 2005. He also is the owner of Valkyrie Pewter, a renaissance and fantasy pewter hand-sculpted and handcrafted jewelry maker sold at retail shops at the Ohio Renaissance Festival and Great Lakes Medieval fair. Brian hopes to be a voice for 3D printing, and agile short run customer reactive manufacturing (Industry 4.0) and empower people of all ages with the tools to bring ideas to life through CAD and 3D printing.",
      "links": [
        {
          "title": "Blog",
          "url": "https://www.seadoggamestudios.com/"
        }
      ]
    }
  ],
  "room": "Crown Palm",
  "track": "KidzMash",
  "tags": [],
  "format": "KidzMash Divez",
  "level": "",
  "day": "Tuesday",
  "startTime": "10:00",
  "endTime": "12:00",
  "excerpt": "This second session is a follow up where we get to make 3D models! Children must have a responsible adult present. We will work with a fully featured CAD application called Rhino3d and walk through the process of building a basic model from geometric shapes. We will explain the XYZ coordinate...",
  "description": "This second session is a follow up where we get to make 3D models! Children must have a responsible adult present. We will work with a fully featured CAD application called Rhino3d and walk through the process of building a basic model from geometric shapes. We will explain the XYZ coordinate system, and what the different views are for. We will also spend some time playing with the transform functions. This session is best for kids with basic skills in measurement, elementary-level geometry, and basic computer skills. The session is probably most appropriate for children over 8 but all are welcome based on the child's capabilities and ability to enjoy. The goal of the session will be to create up to two basic things- a cup, and a keychain.\nLess confident or younger kids are welcome to pair up with parents or siblings and just watch the parent/sibling. Kids that complete the kid projects without issue are welcome in the adult walk-through lab as they will be making slightly more advanced models that are different.\n\nPLEASE NOTE: We have a fairly large number of printers in the lab so our kids can possibly print items they make in class. If your child completes a model, we will be able to produce a screen render if desired or we will make our best efforts to print at least one model per student, based on demand."
}